Repository: qhta/Quest
Catalog: QuestRSX/MeasureStrings.*.resx
Languages: pl

# NonFunctionalRequirementsNumbered
source: Have non-functional requirements been numbered (identified with identifiers)?
pl: Czy wymagania niefunkcjonalne zostały ponumerowane (oznaczone identyfikatorami)?

# FunctionalRequirementsHaveSpecificResults
source: Do all functional requirements have specific results?
pl: Czy wszystkie wymagania funkcjonalne mają określone rezultaty?

# NonFunctionalRequirementsSpecificallySpecified
source: Are all non-functional requirements specifically specified?
pl: Czy wszystkie wymagania niefunkcjonalne są konkretnie określone?

# AcceptanceCriteriaSpecified
source: Are the acceptance criteria specified?
pl: Czy wyspecyfikowano kryteria akceptacji?

# EmergencyTestingConditionsSpecified
source: Are there conditions for testing for emergency situations?
pl: Czy określono warunki testowania sytuacji wyjątkowych?

# CriticalSituationTestingRequirements
source: Are the requirements for critical situations testable?
pl: Czy wymagania dotyczące sytuacji krytycznych są możliwe do testowania?

# FailureTestingRequirements
source: Are the failure requirements testable?
pl: Czy wymagania dotyczące awarii są możliwe do testowania?

# RequirementsDoNotReferToNonExistentSystems
source: Do the requirements refer to non-existent or inaccessible systems?
pl: Czy wymagania nie odwołują się do nieistniejących lub niedostępnych systemów?

# RequirementsDoNotReferToNonExistentLegalSolutions
source: Do the requirements not refer to non-existent legal solutions?
pl: Czy wymagania nie odwołują się do nieistniejących rozwiązań prawnych?

# RequirementsDoNotReferToUnspecifiedDevelopmentOpportunities
source: Do the requirements not refer to unspecified development opportunities?
pl: Czy wymagania nie odwołują się do nieokreślonych możliwości rozwoju?

# GlossaryClassesIdentified
source: Have all the classes in the glossary been identified?
pl: Czy wszystkie klasy ze słownika pojęć zostały zidentyfikowane?

# RequirementsSpecificationClassesIdentified
source: Have all classes from the requirements specification been identified?
pl: Czy wszystkie klasy ze specyfikacji wymagań zostały zidentyfikowane?

# AdditionalSourceClassesIdentified
source: Have all classes from additional sources been identified?
pl: Czy wszystkie klasy z dodatkowych źródeł zostały zidentyfikowane?

# GlossaryPropertiesIdentified
source: Have all the properties in the glossary been identified?
pl: Czy wszystkie właściwości ze słownika pojęć zostały zidentyfikowane?

# RequirementsSpecificationPropertiesIdentified
source: Have all properties from the requirements specification been identified?
pl: Czy wszystkie właściwości ze specyfikacji wymagań zostały zidentyfikowane?

# AdditionalSourcePropertiesIdentified
source: Have all properties from additional sources been identified?
pl: Czy wszystkie właściwości z dodatkowych źródeł zostały zidentyfikowane?

# GlossaryPossibilitiesIdentified
source: Have all the possibilities from the glossary been identified?
pl: Czy wszystkie możliwości ze słownika pojęć zostały zidentyfikowane?

# RequirementsSpecificationPossibilitiesIdentified
source: Have all the possibilities from the requirements specification been identified?
pl: Czy wszystkie możliwości ze specyfikacji wymagań zostały zidentyfikowane?

# AdditionalSourcePossibilitiesIdentified
source: Have all the opportunities from additional sources been identified?
pl: Czy wszystkie możliwości z dodatkowych źródeł zostały zidentyfikowane?

# PropertyTypesSpecified
source: Are property types specified?
pl: Czy określono typy właściwości?

# MultiplicityPropertiesSpecified
source: Are multiplicity properties specified?
pl: Czy określono krotności właściwości?

# PropertyValuesSpecified
source: Are property values (default/calculated expressions) specified?
pl: Czy określono wartości właściwości (domyślne/wyrażenia obliczeniowe)?

# PossibilityStereotypesDefined
source: Have stereotypes of possibility been defined?
pl: Czy określono stereotypy możliwości?

# ArgumentsSpecified
source: Are arguments specified?
pl: Czy określono argumenty?

# ResultTypesSpecified
source: Are types of results specified?
pl: Czy określono typy wyników?

# EnumerationTypesDefined
source: Are enumeration types defined?
pl: Czy zdefiniowano typy wyliczeniowe?

# StructuralTypesDefined
source: Are structural types defined?
pl: Czy zdefiniowano typy strukturalne?

# InterfaceTypesDefined
source: Are interface types defined?
pl: Czy zdefiniowano typy interfejsowe?

# GeneralizedClassesIdentified
source: Have generalized classes been identified?
pl: Czy zidentyfikowano klasy uogólnione?

# SpecializedClassesIdentified
source: Have specialized classes been identified?
pl: Czy zidentyfikowano klasy wyspecjalizowane?

# ClassHierarchyIdentified
source: Has the full class hierarchy been identified?
pl: Czy zidentyfikowano pełną hierarchię klas?

# AggregationClassesIdentified
source: Have aggregation classes been identified?
pl: Czy zidentyfikowano klasy agregacyjne?

# RelationshipObligationSpecified
source: Is the obligation/optionality of the relationship specified?
pl: Czy określono obowiązkowość/opcjonalność relacji?

# RelationshipMultiplicityDefined
source: Is the multiplicity of the relationship defined?
pl: Czy zdefiniowano krotność relacji?

# ClassAssociationsIdentified
source: Have associations between classes been identified?
pl: Czy zidentyfikowano asocjacje między klasami?

# AssociationNamesSpecified
source: Are association names specified?
pl: Czy określono nazwy asocjacji?

# AssociationDirectionDetermined
source: Has the direction of association been determined?
pl: Czy określono kierunek asocjacji?

# IdentifiedClassesSpecified
source: Have all identified classes been specified?
pl: Czy wszystkie zidentyfikowane klasy zostały wyspecyfikowane?

# ClassShortDescriptionsProvided
source: Does each class have a short description?
pl: Czy każda klasa ma krótki opis?

# IdentifiedPropertiesSpecified
source: Have all identified properties been specified?
pl: Czy wszystkie zidentyfikowane właściwości zostały wyspecyfikowane?

# PropertySpecificationsComplete
source: Do the specified properties have a complete specification?
pl: Czy wyspecyfikowane właściwości mają kompletną specyfikację?

# IdentifiedOpportunitiesSpecified
source: Have all identified opportunities been specified?
pl: Czy wszystkie zidentyfikowane możliwości zostały wyspecyfikowane?

# OpportunitySpecificationsComplete
source: Do the specified capabilities have a complete specification?
pl: Czy wyspecyfikowane możliwości mają kompletną specyfikację?

# IdentifiedRelationshipsSpecified
source: Have all identified relationships been specified?
pl: Czy wszystkie zidentyfikowane relacje zostały wyspecyfikowane?

# RelationshipSpecificationsComplete
source: Do the specified relationships have a complete specification?
pl: Czy wyspecyfikowane relacje mają kompletną specyfikację?

# ClassesCorrectlyDefined
source: Are the classes correctly defined?
pl: Czy klasy są poprawnie podefiniowane?

# PropertiesCorrectlyDefined
source: Are the properties correctly defined?
pl: Czy właściwości są poprawnie podefiniowane?

# PossibilitiesCorrectlyDefined
source: Are the possibilities correctly defined?
pl: Czy możliwości są poprawnie podefiniowane?

# RelationshipsCorrectlyDefined
source: Are the relationships correctly defined?
pl: Czy relacje są poprawnie podefiniowane?

# ParametersCorrectlyDefined
source: Are the parameters correctly defined?
pl: Czy parametry są poprawnie podefiniowane?

# TypesCorrectlyDefined
source: Are the types correctly defined?
pl: Czy typy są poprawnie podefiniowane?

# ClassModelStandardsCompliance
source: Was the class model made according to the standards?
pl: Czy model klas wykonano zgodnie ze standardami?

# ClassDiagramFormalRulesCompliance
source: Was the class diagram made according to formal rules?
pl: Czy diagram klas wykonano zgodnie z formalnymi regułami?

# ClassSpecificationStandardsCompliance
source: Was the class specification made in accordance with the standards?
pl: Czy specyfikację klas wykonano zgodnie ze standardami?

# ClassesRelatedByRelationships
source: Are all classes related by relationships?
pl: Czy wszystkie klasy są powiązane relacjami?

# RelationshipPropertiesDefined
source: Are properties that illustrate relationships defined?
pl: Czy podefiniowano właściwości obrazujące relacje?

# ClassDiagramsConsistent
source: Are class diagrams consistent?
pl: Czy diagramy klas są spójne?

# ConsistentClassDiagram
source: Is there one consistent class diagram?
pl: Czy występuje jeden spójny diagram klasy?

# ClassNamesConsistentWithRequirements
source: Are the class names consistent with the names in the requirements specification?
pl: Czy nazwy klas są spójne z nazwami w specyfikacji wymagań?

# PropertyNamesConsistentWithRequirements
source: Are the property names consistent with the names in the requirements specification?
pl: Czy nazwy właściwości są spójne z nazwami w specyfikacji wymagań?

# CapabilityNamesConsistentWithRequirements
source: Are the capability names consistent with the names in the requirements specification?
pl: Czy nazwy możliwości są spójne z nazwami w specyfikacji wymagań?

# RelationshipTypesAndNamesConsistentWithRequirements
source: Are the relationship types and names consistent with the requirements specification?
pl: Czy typy i nazwy relacje są spójne ze specyfikacją wymagań?

# PropertyShortDescriptionsProvided
source: Does each property have a short description?
pl: Czy każda właściwość ma krótki opis?

# OptionShortDescriptionsProvided
source: Does each option have a short description?
pl: Czy każda możliwość ma krótki opis?

# AccountShortDescriptionsProvided
source: Does each account have a short description?
pl: Czy każda relacja ma krótki opis?

# DescriptionsUnderstandable
source: Are the descriptions understandable?
pl: Czy opisy są zrozumiałe?

# NamesUnderstandable
source: Are the names understandable?
pl: Czy stosowane nazwy są zrozumiałe?

# NamesNotTooLong
source: Aren't they too long?
pl: Czy nie są zbyt długie?

# SynonymsResolvedCorrectly
source: Are synonyms solved correctly?
pl: Czy synonimy są prawidłowo rozwiązane?

# GeneralizedTypesUsed
source: Are generalized types used?
pl: Czy stosuje się typy uogólnione?

# GeneralizedContainerTypesNotation
source: Is there a generalized notation of container types?
pl: Czy stosuje się uogólniony zapis typów kontenerowych?

# GeneralizedClassesNotTooSpecific
source: Aren't generalized classes too specifically?
pl: Czy klasy uogólnione nie są zbyt szczegółowo zdefiniowane?

# AggregationClassesNotTooDetailed
source: Aren't aggregation classes defined in too much detail?
pl: Czy klasy agregacyjne nie są zbyt szczegółowo zdefiniowane?

# DiagramsNotTooTightlyDrawn
source: Aren't the diagrams too tightly drawn?
pl: Czy diagramy nie są zbyt ściśle narysowane?

# SpecificationAllowsClassAdditionOrRemoval
source: Does the specification allow for easy addition/removal of classes?
pl: Czy specyfikacja umożliwia łatwe dodawanie/usuwanie klas?

# ClassesHaveGlossaryReferences
source: Do classes have glossary references?
pl: Czy klasy mają referencje do słownika pojęć?

# PropertiesHaveSpecificReferences
source: Do properties have specific references?
pl: Czy właściwości mają określone referencje?

# CapabilitiesHaveSpecificReferences
source: Do the capabilities have specific references?
pl: Czy możliwości mają określone referencje?

# RelationshipsHaveSpecificReferences
source: Do relationships have specific references?
pl: Czy relacje mają określone referencje?

# ClassesHaveSeparateIdentifiers
source: Do classes have separate identifiers in addition to names?
pl: Czy klasy oprócz nazw mają osobne identyfikatory?

# RelationshipsHaveSeparateIdentifiers
source: Do relationships have separate identifiers in addition to names?
pl: Czy relacje oprócz nazw mają osobne identyfikatory?

# UsersMappedToActors
source: Are all users mapped into actors?
pl: Czy wszyscy użytkownicy są odwzorowani w aktorów?

# ActorsNotMissing
source: Are there still some actors missing?
pl: Czy nie brakuje jeszcze jakichś aktorów?

# FunctionalRequirementsMappedToUseCases
source: Are all functional requirements mapped in use cases?
pl: Czy wszystkie wymagania funkcjonalne są odwzorowanie w przypadkach użycia?

# UseCasesNotMissing
source: Are there still some use cases missing?
pl: Czy nie brakuje jeszcze jakichś przypadków użycia?

# GeneralizedActorsIdentified
source: Have generalized actors been identified?
pl: Czy zidentyfikowano uogólnionych aktorów?

# SpecializedActorsIdentified
source: Have specialized actors been identified? Or exhaustive?
pl: Czy zidentyfikowano wyspecjalizowanych aktorów? Czy wyczerpująco?

# GeneralizedAndSpecializedActorRelationshipsShown
source: Is the relationship between generalized and specialized actors shown?
pl: Czy pokazano relacje pomiędzy aktorami uogólnionymi i wyspecjalizowanymi?

# GeneralizedUseCasesIdentified
source: Have generalized use cases been identified?
pl: Czy zidentyfikowano uogólnione przypadki użycia?

# SpecializedUseCasesIdentified
source: Have specialized use cases been identified? Or exhaustive?
pl: Czy zidentyfikowano wyspecjalizowane przypadki użycia? Czy wyczerpująco?

# GeneralizedAndSpecializedUseCaseRelationshipsShown
source: Are the relationships between generalized and specialized cases shown?
pl: Czy pokazano relacje między przypadkami uogólnionymi i wyspecjalizowanymi?

# ComplexUseCasesIdentified
source: Have complex use cases been identified?
pl: Czy zidentyfikowano złożone przypadki użycia?

# ComponentUseCasesIdentified
source: Have component use cases been identified? Or exhaustive?
pl: Czy zidentyfikowano składowe przypadki użycia? Czy wyczerpująco?

# ComplexAndComponentUseCaseRelationshipsShown
source: Are the relationships between complex and component cases shown?
pl: Czy pokazano relacje między przypadkami złożonymi i składowymi?

# ExtensibleUseCasesIdentified
source: Have you identified extensible use cases?
pl: Czy zidentyfikowano przypadki użycia, które można rozszerzać?

# ExtensibleComponentUseCasesIdentified
source: Have extensible component use cases been identified? Or exhaustive?
pl: Czy zidentyfikowano rozszerzające składowe przypadki użycia? Czy wyczerpująco?

# IdentifiedActorsSpecified
source: Have all identified actors been specified?
pl: Czy wszyscy zidentyfikowani aktorzy zostali wyspecyfikowani?

# ActorShortDescriptionsProvided
source: Does each actor have a short description?
pl: Czy każdy aktor ma krótki opis?

# IdentifiedUseCasesSpecified
source: Have all identified use cases been specified?
pl: Czy wszystkie zidentyfikowane przypadki użycia zostały wyspecyfikowane?

# UseCaseSpecificationsComplete
source: Do the specified use cases have a complete specification?
pl: Czy wyspecyfikowane przypadki użycia mają kompletną specyfikację?

# UseCasesCorrectlyDefined
source: Are the use cases defined correctly?
pl: Czy przypadki użycia są poprawnie zdefiniowane?

# ActorsCorrectlyDefined
source: Are the actors defined correctly?
pl: Czy aktorzy są poprawnie zdefiniowani?

# ActorUseCaseRelationshipsCorrectlyDefined
source: Are the relationships of actors and use cases correctly defined?
pl: Czy relacje aktorów i przypadków użycia są poprawnie zdefiniowane?

# UseCaseModelStandardsCompliance
source: Was the use case model made to standards?
pl: Czy model przypadków użycia wykonano zgodnie ze standardami?

# UseCaseDiagramFormalRulesCompliance
source: Was the use case diagram made according to formal rules?
pl: Czy diagram przypadków użycia wykonano zgodnie z formalnymi regułami?

# UseCaseSpecificationStandardsCompliance
source: Is the use case specification done to the standards?
pl: Czy specyfikację przypadków użycia wykonano zgodnie ze standardami?

# ActorsConnectedToUseCases
source: Is every actor connected to some kind of use case?
pl: Czy każdy aktor jest połączony z jakimś przypadkiem użycia?

# UseCasesConnectedToActors
source: Is each use case connected to an actor (even indirectly)?
pl: Czy każdy przypadek użycia jest połączony z jakimś aktorem (nawet pośrednio)?

# SpecificationConsistentWithDiagram
source: Is the specification consistent with the diagram?
pl: Czy specyfikacja jest spójna z diagramem?

# UseCasesAlignedWithFunctionalRequirements
source: Are the use cases aligned with the functional requirements?
pl: Czy przypadki użycia są zgodne z wymaganiami funkcjonalnymi?

# ActorDefinitionsMatchUserDefinitions
source: Do the actor definitions match the user definitions?
pl: Czy definicje aktorów są zgodne z definicjami użytkowników?

# ActorDefinitionsAppearAsClasses
source: Do actor definitions appear as classes in the class model?
pl: Czy definicje aktorów występują jako klasy w modelu klas?

# UseCasesTiedToActorCapabilities
source: Are use cases tied to the respective capabilities of the actors?
pl: Czy przypadki użycia są powiązane z odpowiednimi możliwościami aktorów?

# UseCaseShortDescriptionsProvided
source: Does each use case have a brief description?
pl: Czy każdy przypadek użycia ma krótki opis?

# SpecificationAllowsElementAdditionOrRemoval
source: Does the specification allow for easy addition/removal of elements?
pl: Czy specyfikacja umożliwia łatwe dodawanie/usuwanie elementów?

# UseCasesHaveFunctionalRequirementReferences
source: Do the use cases have references to functional requirements?
pl: Czy przypadki użycia mają referencje do wymagań funkcjonalnych?

# UseCasesHaveMutualReferences
source: Do use cases have references between them?
pl: Czy przypadki użycia mają referencje między sobą?

# UseCasesHaveSeparateIdentifiers
source: Do use cases have separate identifiers in addition to names?
pl: Czy przypadki użycia oprócz nazw mają osobne identyfikatory?

# ActorsHaveSeparateIdentifiers
source: Do actors have separate IDs in addition to their names?
pl: Czy aktorzy oprócz nazw mają osobne identyfikatory?

# EachCaseHasSpecificInteraction
source: Does each case have a specific interaction?
pl: Czy każdy przypadek ma określoną interakcję?

# InteractionsNotMissing
source: Are there still some interactions missing?
pl: Czy nie brakuje jeszcze jakichś interakcji?

# ActorsShareholderInInteraction
source: Is every actor a shareholder in the interaction?
pl: Czy każdy aktor jest udziałowcem interakcji?

# SystemComponentsInvolvedInInteraction
source: Are the defined system components involved in the interaction?
pl: Czy zdefiniowane komponenty systemu biorą udział w interakcji?

# ShareholdersNotMissing
source: Aren't there any shareholders missing?
pl: Czy nie brakuje jeszcze jakichś udziałowców?

# DataMappedInMessages
source: Is all the data passed mapped in the messages?
pl: Czy wszystkie przekazywane dane mają odwzorowanie w komunikatach?

# FeedbackMessagesSpecified
source: Are the feedback messages (confirmations, replies, notifications) specified?
pl: Czy komunikaty zwrotne (potwierdzenia, odpowiedzi, powiadomienia) są okreslone?

# MessagesNotMissing
source: Are there any other messages missing?
pl: Czy nie brakuje jeszcze jakichś komunikatów?

# EachMessageHasSpecificEffect
source: Does each message have a specific effect?
pl: Czy każdy komunikat ma określony efekt?

# FlowConditionsFixed
source: Are all flow conditions fixed?
pl: Czy wszystkie warunki przepływu są ustalone?

# ActorMessagesHaveFeedbackMessages
source: Does every message from an actor have a feedback message?
pl: Czy każdy komunikat od aktora ma komunikat zwrotny?

# IdentifiedInteractionsSpecified
source: Have all identified interactions been specified?
pl: Czy wszystkie zidentyfikowane interakcje zostały wyspecyfikowane?

# InteractionSpecificCircumstances
source: Does each interaction have specific circumstances?
pl: Czy każda interakcja ma określone okoliczności?

# InteractionSpecificPurpose
source: Does each interaction have a specific purpose?
pl: Czy każda interakcja ma określony cel?

# InteractionShortDescriptionsProvided
source: Does every interaction have a short description?
pl: Czy każda interakcja ma krótki opis?

# InteractionsCorrectlyDefined
source: Are interactions defined correctly?
pl: Czy interakcje są prawidłowo zdefiniowane?

# InteractionShareholdersCorrectlyDefined
source: Are the shareholders of the interaction correctly defined?
pl: Czy udziałowcy interakcji są prawidłowo zdefiniowani?

# MessageFlowsValid
source: Are message flows valid?
pl: Czy przepływy komunikatów są prawidłowe?

# InteractionModelStandardsCompliance
source: Was the interaction model made according to standards?
pl: Czy model interakcji wykonano zgodnie ze standardami?

# InteractionDiagramsFormalRulesCompliance
source: Were the interaction diagrams made according to formal rules?
pl: Czy diagramy interakcji wykonano zgodnie z formalnymi regułami?

# InteractionSpecificationFormalRulesCompliance
source: Was the interaction specification made in accordance with formal rules?
pl: Czy specyfikację interakcji wykonano zgodnie z formalnymi regułami?

# InteractionNamesAndClassesMatch
source: Do the names and classes used in all interactions match each other?
pl: Czy nazwy i klasy stosowane we wszystkich interakcjach są ze sobą zgodne?

# MessageFlowInternallyConsistent
source: Is the message flow internally consistent?
pl: Czy przepływ komunikatów jest wewnętrznie spójny?

# InteractionActorsAndUseCasesMatch
source: Do the number and classes of actors in interactions and use cases match each other?
pl: Czy ilość i klasy aktorów w interakcjach i przypadkach użycia są ze sobą zgodne?

# InteractionContentMatchesUseCaseDescriptions
source: Does the interaction content match the descriptions of the use cases?
pl: Czy zawartości interakcji odpowiadają opisom przypadków użycia?

# InteractionParticipantDefinitionsConformToRequirements
source: Do the definitions of interaction participants conform to the requirements specification?
pl: Czy definicje uczestników interakcji są zgodne ze specyfikacją wymagań?

# MessageDefinitionsConformToRequirements
source: Do the message definitions conform to the requirements specification?
pl: Czy definicje komunikatów są zgodne ze specyfikacją wymagań?

# InteractionParticipantDefinitionsAppearAsClasses
source: Do interaction participant definitions appear as classes in the class model?
pl: Czy definicje uczestników interakcji występują jako klasy w modelu klas?

# MessageProcessingCapabilitiesForRecipients
source: Does message processing have the right capabilities for recipients?
pl: Czy przetwarzanie komunikatów ma odpowiednie możliwości u odbiorców?

# MessagesRelatedToEvents
source: Are messages related to events?
pl: Czy komunikaty są powiązane ze zdarzeniami?

# SequenceAndCollaborationDiagramsCompatible
source: Are sequence and collaboration diagrams compatible with each other?
pl: Czy diagramy sekwencji i kolaboracji są ze sobą zgodne?

# InteractionsHaveUseCaseReferences
source: Do the interactions have references to use cases/functional requirements?
pl: Czy interakcje mają referencje do przypadków użycia/wymagań funkcjonalnych?

# InteractionsHaveMutualReferences
source: Do interactions have mutual references?
pl: Czy interakcje mają referencje wzajemne?

# InteractionsHaveSeparateIdentifiers
source: Do interactions have separate identifiers in addition to names?
pl: Czy interakcje oprócz nazw mają osobne identyfikatory?

# MessagesHaveSeparateIdentifiers
source: Do messages have separate identifiers in addition to names?
pl: Czy komunikaty oprócz nazw mają osobne identyfikatory?

# EachCaseHasSpecificActivity
source: Does each case have a specific activity?
pl: Czy każdy przypadek ma określoną aktywność?

# ActivitiesNotMissing
source: Are there any other activities missing?
pl: Czy nie brakuje jeszcze jakichś aktywności?
