Repository: qhta/Quest
Catalog: QuestRSX/MeasureStrings.*.resx
Languages: pl

# ShareholdersHaveResponsibilityAreas
source: Does each shareholder (animated) have their own area of responsibility?
pl: Czy każdy udziałowiec (ożywiony) ma swój obszar odpowiedzialności?

# ActivitiesInSpecificResponsibilityAreas
source: Is each activity in a specific area of responsibility?
pl: Czy każda aktywność jest w określonym obszarze odpowiedzialności?

# InterfacesForActivityAreaTransitions
source: Is there an interface for each transition between activity areas?
pl: Czy dla każdego przejścia między obszarami aktywności jest interfejs?

# SpecificStartForEachFlow
source: Is there a specific start for each flow?
pl: Czy dla każdego przepływu jest określony początek?

# EndForEachFlow
source: Is there an end for each flow?
pl: Czy dla każdego przepływu jest określony koniec?

# ReflowingConditionsSpecified
source: Is each reflowing condition specified?
pl: Czy każdy warunek rozpływu jest określony?

# IdentifiedActivitiesSpecified
source: Have all identified activities been specified?
pl: Czy wszystkie zidentyfikowane aktywności zostały wyspecyfikowane?

# ActivitySpecificCircumstances
source: Does each activity have specific circumstances?
pl: Czy każda aktywność ma określone okoliczności?

# ActivitySpecificGoals
source: Does each activity have a specific goal?
pl: Czy każda aktywność ma określony cel?

# ActivityShortDescriptionsProvided
source: Does each activity have a short description?
pl: Czy każda aktywność ma krótki opis?

# ActivitiesCorrectlyDefined
source: Are the activities defined correctly?
pl: Czy aktywności są prawidłowo zdefiniowane?

# ActivityShareholdersCorrectlyDefined
source: Are the shareholders of the activity correctly defined?
pl: Czy udziałowcy aktywności są prawidłowo zdefiniowani?

# ActivityFlowsCorrect
source: Are activity flows correct?
pl: Czy przepływy aktywności są prawidłowe?

# ActivityModelStandardsCompliance
source: Was the activity model made in accordance with the standards?
pl: Czy model aktywności wykonano zgodnie ze standardami?

# ActivityDiagramsFormalRulesCompliance
source: Were the activity diagrams made according to formal rules?
pl: Czy diagramy aktywności wykonano zgodnie z formalnymi regułami?

# ActivitySpecificationFormalRulesCompliance
source: Was the activity specification made in accordance with formal rules?
pl: Czy specyfikację aktywności wykonano zgodnie z formalnymi regułami?

# ActivityNamesAndClassesMatch
source: Do the names and classes used in all activities match each other?
pl: Czy nazwy i klasy stosowane we wszystkich aktywnościach są ze sobą zgodne?

# ActivityFlowInternallyConsistent
source: Is the flow of activity internally consistent?
pl: Czy przepływ aktywności jest wewnętrznie spójny?

# ActivityAndUseCaseNamesMatch
source: Do the amount and names of activities and use cases match?
pl: Czy ilość i nazwy aktywności oraz przypadków użycia są ze sobą zgodne?

# ActivityContentMatchesUseCaseDescriptions
source: Does the activity content match the descriptions of the use cases?
pl: Czy zawartości aktywności odpowiadają opisom przypadków użycia?

# ActivityParticipantDefinitionsConformToRequirements
source: Do the definitions of activity participants comply with the requirements specification?
pl: Czy definicje uczestników aktywności są zgodne ze specyfikacją wymagań?

# ActivityFlowsAlignedWithRequirements
source: Are the activity flows aligned with the requirements specification?
pl: Czy przepływy aktywności są zgodne ze specyfikacją wymagań?

# ActivityParticipantDefinitionsAppearAsClasses
source: Do activity participant definitions appear as classes in the class model?
pl: Czy definicje uczestników aktywności występują jako klasy w modelu klas?

# ActivitiesHaveAudienceCapabilities
source: Do the activities have the right capabilities for the audience?
pl: Czy aktywności mają odpowiednie możliwości u odbiorców?

# ActivityTransitionsRelatedToEvents
source: Are activity transitions related to events?
pl: Czy przejścia aktywności są powiązane ze zdarzeniami?

# ActivitiesHaveUseCaseReferences
source: Do the activities have references for use cases/functional requirements?
pl: Czy aktywności mają referencje do przypadków użycia/wymagań funkcjonalnych?

# ActivitiesHaveMutualReferences
source: Do activities have mutual references?
pl: Czy aktywności mają referencje wzajemne?

# ActivitiesHaveSeparateIdentifiers
source: Do activities have separate IDs in addition to names?
pl: Czy aktywności oprócz nazw mają osobne identyfikatory?

# InterfacesHaveSeparateIdentifiers
source: Do interfaces have separate identifiers in addition to names?
pl: Czy interfejsy oprócz nazw mają osobne identyfikatory?

# ActiveClassesIdentified
source: Have all active classes been identified?
pl: Czy zidentyfikowano wszystkie klasy aktywne?

# StateMachinesDefinedForActiveClasses
source: Are state machines defined for all active classes?
pl: Czy zdefiniowano maszyny stanów dla wszystkich klas aktywnych?

# RecessedStateMachinesDefined
source: Are the required recessed state machines defined?
pl: Czy zdefiniowano wymagane zagłębione maszyny stanów?

# ActiveClassStatesIdentified
source: Have all active class states been identified?
pl: Czy wszystkie stany klas aktywnych zostały zidentyfikowane?

# PropertyRelatedStatesIdentified
source: Have all property related states been identified?
pl: Czy wszystkie stany związane z właściwościami zostały zidentyfikowane?

# CapabilityStatesIdentified
source: Have all capability states been identified?
pl: Czy wszystkie stany związane z możliwościami zostały zidentyfikowane?

# MessageForwardingStatesDefined
source: Have all the states related to message forwarding been defined?
pl: Czy wszystkie stany związane z przekazywaniem komunikatów zostały zdefiniowane?

# InitialStateForEachStateMachine
source: Is there an initial state for each state machine?
pl: Czy dla każdej maszyny stanów określono stan początkowy?

# MessageForwardingEventsIdentified
source: Have all message forwarding events been identified?
pl: Czy wszystkie zdarzenia przekazywania komunikatów zostały zidentyfikowane?

# TerminationEventsIdentified
source: Have all termination events been identified?
pl: Czy wszystkie zdarzenia zakończenia aktywności zostały zidentyfikowane?

# TemporalEventsIdentified
source: Have all temporal events been identified?
pl: Czy wszystkie zdarzenia czasowe zostały zidentyfikowane?

# ExceptionalEventsIdentified
source: Have all exceptional events been identified?
pl: Czy wszystkie zdarzenia wyjątkowe zostały zidentyfikowane?

# EachEventHasTransition
source: Does every event have a transition?
pl: Czy każde zdarzenie ma przejście?

# EachPassHasEvent
source: Does every pass have an event?
pl: Czy każde przejście ma zdarzenie?

# TransitionConditionsForSameEvent
source: Do transitions with the same events from the same state have conditions?
pl: Czy przejścia z tymi samymi zdarzeniami z tego samego stanu mają warunki?

# TransitionActionsSpecified
source: Are there any required actions for transitions?
pl: Czy określono wymagane akcje przy przejściach?

# StateMachineSpecificationsProvided
source: Is there a specification for each machine?
pl: Czy dla każdej maszyny podano jej specyfikację?

# StateMachineShortDescriptionsProvided
source: Does each state machine have a short description?
pl: Czy każda maszyna stanów ma krótki opis?

# IdentifiedStatesSpecified
source: Have all identified states been specified?
pl: Czy wszystkie zidentyfikowane stany zostały wyspecyfikowane?

# StateSpecificationsComplete
source: Do the specified states have a complete specification?
pl: Czy wyspecyfikowane stany mają kompletną specyfikację?

# IdentifiedEventsSpecified
source: Have all identified events been specified?
pl: Czy wszystkie zidentyfikowane zdarzenia zostały wyspecyfikowane?

# EventSpecificationsComplete
source: Do the specified events have a complete specification?
pl: Czy wyspecyfikowane zdarzenia mają kompletną specyfikację?

# IdentifiedPassagesSpecified
source: Have all identified passages been specified?
pl: Czy wszystkie zidentyfikowane przejścia zostały wyspecyfikowane?

# PassageSpecificationsComplete
source: Do the specified passages have a complete specification?
pl: Czy wyspecyfikowane przejścia mają kompletną specyfikację?

# StateMachinesCorrectlyDefined
source: Are state machines correctly defined?
pl: Czy maszyny stanów są poprawnie podefiniowane?

# StatesCorrectlyDefined
source: Are states defined correctly?
pl: Czy stany są poprawnie podefiniowane?

# EventsCorrectlyDefined
source: Are the events correctly defined?
pl: Czy zdarzenia są poprawnie podefiniowane?

# TransitionsCorrectlyDefined
source: Are transitions correctly defined?
pl: Czy przejścia są poprawnie podefiniowane?

# StateModelStandardsCompliance
source: Was the state model made to standards?
pl: Czy model stanów wykonano zgodnie ze standardami?

# StateDiagramFormalRulesCompliance
source: Was the state diagram made according to formal rules?
pl: Czy diagram stanów wykonano zgodnie z formalnymi regułami?

# ConditionSpecificationStandardsCompliance
source: Was the condition specification made in accordance with the standards?
pl: Czy specyfikację stanów wykonano zgodnie ze standardami?

# StateDiagramsInternallyConsistent
source: Are all state diagrams internally consistent?
pl: Czy wszystkie diagramy stanów są wewnętrznie spójne?

# RecessedStateMachinesConsistentWithParent
source: Are the recessed state machines consistent with the parent ones?
pl: Czy zagłębione maszyny stanów są spójne z nadrzędnymi?

# StateNamesConsistentWithRequirements
source: Are the state names consistent with the names in the requirements specification?
pl: Czy nazwy stanów są spójne z nazwami w specyfikacji wymagań?

# EventNamesConsistentWithRequirements
source: Are the event names consistent with the names in the requirements specification?
pl: Czy nazwy zdarzeń są spójne z nazwami w specyfikacji wymagań?

# ActionNamesConsistentWithRequirements
source: Are the action names consistent with the requirements specification?
pl: Czy nazwy akcji są spójne ze specyfikacją wymagań?

# StateMachinesAssignedToClasses
source: Are state machines assigned to classes?
pl: Czy maszyny stanów są poprzypisywane do klas?

# ClassPropertiesForStates
source: Are class properties defined to store states?
pl: Czy zdefiniowano właściwości klas przechowujące stany?

# EventClassesDefined
source: Are event classes defined?
pl: Czy zdefiniowano klasy zdarzeń?

# CapabilitiesForEventHandling
source: Have capabilities been defined to handle events?
pl: Czy zdefiniowano możliwości odpowiadające obsłudze zdarzeń?

# CapabilitiesForActionsDefined
source: Have the capabilities corresponding to the actions been defined?
pl: Czy zdefiniowano możliwości odpowiadające akcjom?

# StateShortDescriptionsProvided
source: Does each state have a short description?
pl: Czy każdy stan ma krótki opis?

# EventShortDescriptionsProvided
source: Does each event have a short description?
pl: Czy każde zdarzenie ma krótki opis?

# PassageShortDescriptionsProvided
source: Does each passage have a short description?
pl: Czy każde przejście ma krótki opis?

# StateMachinesHaveClassReferences
source: Do state machines have class references?
pl: Czy maszyny stanów mają referencje do klas?

# StatesHaveSpecificReferences
source: Do states have specific references?
pl: Czy stany mają określone referencje?

# EventsHaveSpecificReferences
source: Do the events have specific references?
pl: Czy zdarzenia mają określone referencje?

# TransitionsHaveSpecificReferences
source: Do the transitions have specific references?
pl: Czy przejścia mają określone referencje?

# StateMachinesHaveSeparateIdentifiers
source: Do state machines have separate identifiers in addition to names?
pl: Czy maszyny stanów oprócz nazw mają osobne identyfikatory?

# StatesHaveSeparateIdentifiers
source: Do states have separate identifiers in addition to names?
pl: Czy stany oprócz nazw mają osobne identyfikatory?

# EventsHaveSeparateIdentifiers
source: Do events have separate IDs in addition to names?
pl: Czy zdarzenia oprócz nazw mają osobne identyfikatory?

# ComponentForEachFunctionalRequirement
source: Is there a component defined for each functional requirement?
pl: Czy dla każdego wymagania funkcjonalnego jest zdefiniowany komponent?

# ComponentRelationshipsIdentified
source: Have all the relationships between components been identified?
pl: Czy wszystkie relacje między komponentami zostały zidentyfikowane?

# ClassesAssignedToComponents
source: Have all classes been assigned to components?
pl: Czy wszystkie klasy zostały przypisane do komponentów?

# ComponentsSpecified
source: Have all components been specified?
pl: Czy wszystkie komponenty zostały wyspecyfikowane?

# ComponentShortDescriptionsProvided
source: Does each component have a short description?
pl: Czy każdy komponent ma krótki opis?

# ComponentSpecificationsComplete
source: Are the component specifications complete?
pl: Czy specyfikacje komponentów są kompletne?

# ComponentDefinitionsCorrect
source: Are component definitions correct?
pl: Czy definicje komponentów są poprawne?

# ComponentModelStandardsCompliance
source: Was the component model made to standards?
pl: Czy model komponentów wykonano zgodnie ze standardami?

# ComponentDiagramFormalRulesCompliance
source: Was the component diagram made according to formal rules?
pl: Czy diagram komponentów wykonano zgodnie z formalnymi regułami?

# ComponentSpecificationFormalRulesCompliance
source: Was the component specification made in accordance with formal rules?
pl: Czy specyfikację komponentów wykonano zgodnie z formalnymi regułami?

# ComponentsRelatedByRelationships
source: Are all components related by relationships?
pl: Czy wszystkie komponenty są powiązane relacjami?

# DependenciesNotCyclical
source: Aren't dependencies cyclical?
pl: Czy zależności nie są cykliczne?

# ComponentModelConsistentWithFunctionalRequirements
source: Is the component model consistent with the functional requirements?
pl: Czy model komponentów jest spójny z wymaganiami funkcjonalnymi?

# ComponentModelConsistentWithClassModel
source: Is the component model consistent with the class model?
pl: Czy model komponentów jest spójny z modelem klas?

# ComponentModelConsistentWithFunctionalModel
source: Is the component model consistent with the functional model?
pl: Czy model komponentów jest spójny z modelem funkcjonalnym?

# DiagramsProvided
source: Are there any diagrams?
pl: Czy zamieszczono odpowiednie diagramy?

# ModuleDivisionAppropriate
source: Is the division into modules appropriate?
pl: Czy podział na moduły jest odpowiedni?

# SpecificationAllowsComponentAdditionOrRemoval
source: Does the specification allow for easy addition/removal of components?
pl: Czy specyfikacja umożliwia łatwe dodawanie/usuwanie komponentów?

# ComponentsHaveRequirementReferences
source: Do the components have references to the requirements specification?
pl: Czy komponenty mają referencje do specyfikacji wymagań?

# ComponentsHaveSeparateIdentifiers
source: Do components have separate identifiers in addition to names?
pl: Czy komponenty oprócz nazw mają osobne identyfikatory?

# FormsFromFunctionalModelDefined
source: Have all forms resulting from the functional model been defined?
pl: Czy zdefiniowano wszystkie formularze wynikające z modelu funkcjonalnego?

# FormsFromDataModelDefined
source: Have all forms resulting from the data model been defined?
pl: Czy zdefiniowano wszystkie formularze wynikające z modelu danych?

# BasicDialoguesDefined
source: Are basic dialogues defined?
pl: Czy zdefiniowano podstawowe dialogi?

# AuxiliaryDialoguesDefined
source: Are auxiliary dialogues defined?
pl: Czy zdefiniowano pomocnicze dialogi?

# BasicReportsDefined
source: Are basic reports defined?
pl: Czy zdefiniowano podstawowe raporty?

# SecondaryReportsDefined
source: Are secondary reports defined?
pl: Czy zdefiniowano pomocnicze raporty?

# NavigationBetweenFormsDefined
source: Is there a definition of navigation between forms?
pl: Czy zdefiniowano nawigację między formularzami?

# UserCommandsDefined
source: Are user commands defined?
pl: Czy zdefiniowano komendy użytkownika?

# MenuStructureDefined
source: Is there a menu structure defined?
pl: Czy zdefiniowano strukturę menu?

# ToolbarsDefined
source: Are toolbars defined?
pl: Czy zdefiniowano paski narzędziowe?

# NavigationDiagramsCreated
source: Have navigation diagrams been made?
pl: Czy sporządzono diagramy nawigacji?

# NavigationDiagramsComplete
source: Are navigation diagrams complete?
pl: Czy diagramy nawigacji są kompletne?

# FormDraftsCreated
source: Have drafts of forms been made?
pl: Czy sporządzono projekty formularzy?

# FormDesignsComplete
source: Are the form designs complete?
pl: Czy projekty formularzy są kompletne?

# DraftReportsCreated
source: Have draft reports been prepared?
pl: Czy sporządzono projekty raportów?

# DraftReportsComplete
source: Are the draft reports complete?
pl: Czy projekty raportów są kompletne?

# CommandsSpecified
source: Have all commands been specified?
pl: Czy wszystkie komendy zostały wyspecyfikowane?

# CommandShortDescriptionsProvided
source: Does each command have a short description?
pl: Czy każda komenda ma krótki opis?

# CommandSpecificationsComplete
source: Are the command specifications complete?
pl: Czy specyfikacje komend są kompletne?

# FormsSpecified
source: Have all forms been specified?
pl: Czy wszystkie formularze zostały wyspecyfikowane?

# FormShortDescriptionsProvided
source: Does each form have a short description?
pl: Czy każdy formularz ma krótki opis?

# FormSpecificationsComplete
source: Are the form specifications complete?
pl: Czy specyfikacje formularzy są kompletne?

# ReportsSpecified
source: Have all reports been specified?
pl: Czy wszystkie raporty zostały wyspecyfikowane?

# ReportShortDescriptionsProvided
source: Does each report have a short description?
pl: Czy każdy raport ma krótki opis?

# ReportSpecificationsComplete
source: Are the report specifications complete?
pl: Czy specyfikacje raportów są kompletne?

# FormDefinitionsCorrect
source: Are the form definitions correct?
pl: Czy definicje formularzy są poprawne?

# DialogueDefinitionsCorrect
source: Are the dialogue definitions correct?
pl: Czy definicje dialogów są poprawne?

# ReportDefinitionsCorrect
source: Are the report definitions correct?
pl: Czy definicje raportów są poprawne?

# ControlDefinitionsCorrect
source: Are the control definitions correct?
pl: Czy definicje sterowania są poprawne?

# UserInterfaceDesignStandardsCompliance
source: Is the user interface design done according to standards?
pl: Czy projekt interfejsu użytkownika wykonano zgodnie ze standardami?

# IUComponentDesignFormalRulesCompliance
source: Were the designs of the I.U. components made in accordance with the formal rules?
pl: Czy projekty komponentów i.u. wykonano zgodnie z formalnymi regułami?

# IUComponentSpecificationFormalRulesCompliance
source: Was the specification of the components i.u. made in accordance with the formal rules?
pl: Czy specyfikację komponentów i.u. wykonano zgodnie z formalnymi regułami?

# IUComponentsRelatedByRelationships
source: Are all components of the I.U related by relationships?
pl: Czy wszystkie komponenty i.u. są powiązane relacjami?

# IUDesignConsistentWithRequirements
source: Is the i.u. design consistent with the requirements specification?
pl: Czy projekt i.u. jest spójny ze specyfikacją wymagań?

# IUDesignConsistentWithStaticModel
source: Is the i.u. design consistent with the static model?
pl: Czy projekt i.u. jest spójny z modelem statycznym?

# IUDesignConsistentWithFunctionalModel
source: Is the i.u. design consistent with the functional model?
pl: Czy projekt i.u. jest spójny z modelem funkcjonalnym?

# IUComponentShortDescriptionsProvided
source: Does each i.u. component have a short description?
pl: Czy każdy komponent i.u. ma krótki opis?

# IUComponentDivisionAppropriate
source: Is the division into components of the I.U. appropriate?
pl: Czy podział na komponenty i.u. jest odpowiedni?

# SpecificationAllowsIUComponentAdditionOrRemoval
source: Does the specification allow for easy addition/removal of i.u. components?
pl: Czy specyfikacja umożliwia łatwe dodawanie/usuwanie komponentów i.u.?

# IUComponentsHaveReferences
source: Do the components have the appropriate references?
pl: Czy komponenty i.u. mają odpowiednie referencje?

# IUComponentsHaveSeparateIdentifiers
source: Do i.u. components have separate identifiers in addition to names?
pl: Czy komponenty i.u. oprócz nazw mają osobne identyfikatory?

# PersistentClassesDefined
source: Are persistent classes defined?
pl: Czy zdefiniowano klasy trwałe?

# DataStructureForPersistentClassesDefined
source: Is there a data structure defined for each persistent class?
pl: Czy dla każdej klasy trwałej zdefiniowano strukturę danych?

# DataStructureRelationshipsIdentified
source: Have all relationships between data structures been identified?
pl: Czy wszystkie relacje między strukturami danych zostały zidentyfikowane?

# DataStructureDiagramsCreated
source: Have you created data structure diagrams?
pl: Czy sporządzono diagramy struktur danych?

# DataStructureDiagramsComplete
source: Are data structure diagrams complete?
pl: Czy diagramy struktur danych są kompletne?

# DataStructuresSpecified
source: Have all data structures been specified?
pl: Czy wszystkie struktury danych zostały wyspecyfikowane?

# DataStructureShortDescriptionsProvided
source: Does each data structure have a short description?
pl: Czy każda struktura danych ma krótki opis?

# DataStructureSpecificationsComplete
source: Are the specifications of the data structures complete?
pl: Czy specyfikacje struktur danych są kompletne?

# DataStructureDefinitionsCorrect
source: Are the data structure definitions correct?
pl: Czy definicje struktur danych są poprawne?

# DataStructureModelStandardsCompliance
source: Is the data structure model made in accordance with the standards?
pl: Czy model struktur danych wykonano zgodnie ze standardami?

# DataStructureDiagramFormalRulesCompliance
source: Was the data structure diagram made according to formal rules?
pl: Czy diagram struktur danych wykonano zgodnie z formalnymi regułami?

# DataStructureSpecificationFormalRulesCompliance
source: Was the specification of the data structures made according to formal rules?
pl: Czy specyfikację struktur danych wykonano zgodnie z formalnymi regułami?

# DataStructuresRelatedByRelationships
source: Are all data structures related by relationships?
pl: Czy wszystkie struktury danych są powiązane relacjami?

# DataStructureModelConsistentWithRequirements
source: Is the data structure model consistent with the requirements specification?
pl: Czy model struktur danych jest spójny ze specyfikacją wymagań?

# DataStructureModelConsistentWithClassModel
source: Is the data structure model consistent with the class model?
pl: Czy model struktur danych jest spójny z modelem klas?

# DataModuleDivisionAppropriate
source: Is the division into data modules appropriate?
pl: Czy podział na moduły danych jest odpowiedni?

# SpecificationAllowsDataStructureAdditionOrRemoval
source: Does the specification allow easy addition/removal of data structures?
pl: Czy specyfikacja umożliwia łatwe dodawanie/usuwanie struktur danych?

# DataStructuresHaveReferences
source: Do the data structures have the right references?
pl: Czy struktury danych mają odpowiednie referencje?

# DataStructuresHaveSeparateIdentifiers
source: Do data structures have separate identifiers in addition to names?
pl: Czy struktury danych oprócz nazw mają osobne identyfikatory?

# SystemObjectivesAchieved
source: Have all the objectives of the system been achieved?
pl: Czy wszystkie cele systemu zostały zrealizowane?
