Repository: qhta/Quest
Catalog: QuestRSX/MeasureStrings.*.resx
Languages: pl

# IssuesResolved
source: Are the issues resolved?
pl: Czy problemy zostały rozwiązane?

# BenefitsProvided
source: Have the benefits been provided?
pl: Czy korzyści zostały zapewnione?

# CoreShareholderRequirementsMet
source: Have the requirements of the core shareholders been met?
pl: Czy wymagania podstawowych udziałowców zostały spełnione?

# AdditionalShareholderRequirementsMet
source: Have the requirements of additional shareholders been met?
pl: Czy wymagania dodatkowych udziałowców zostały spełnione?

# ExternalShareholderRequirementsMet
source: Have the requirements of external shareholders been met?
pl: Czy wymagania udziałowców zewnętrznych zostały spełnione?

# BasicUserRequirementsMet
source: Have the requirements of the basic users been met?
pl: Czy wymagania podstawowych użytkowników zostały spełnione?

# AdditionalUserRequirementsMet
source: Have the requirements of additional users been met?
pl: Czy wymagania dodatkowych użytkowników zostały spełnione?

# UserTasksAssured
source: Is all user tasks assured?
pl: Czy wykonywanie wszystkich zadań użytkowników zostało zapewnione?

# RequiredFeaturesImplemented
source: Have all the required features been implemented?
pl: Czy wszystkie wymagane funkcje zostały zaimplementowane?

# FeaturesImplementedCompletely
source: Has each feature been implemented completely?
pl: Czy każda funkcja została zaimplementowana kompletnie?

# DataInputsImplemented
source: Are all data inputs (all files) implemented?
pl: Czy zaimplementowano wszystkie wejścia danych (wszystkie pliki)?

# DataOutputsImplemented
source: Have all data outputs (all files) been implemented?
pl: Czy zaimplementowano wszystkie wyjścia danych (wszystkie pliki)?

# StoredDataImplemented
source: Have all stored data (tables, files) been implemented?
pl: Czy zaimplementowano wszystkie dane przechowywane (tabele, pliki)?

# DataProcessingMethodsImplemented
source: Have all data processing methods been implemented?
pl: Czy zaimplementowano wszystkie sposoby przetwarzania danych?

# ProcessesImplemented
source: Have all processes been implemented?
pl: Czy zaimplementowano wszystkie procesy?

# OperationsImplemented
source: Have all operations been implemented?
pl: Czy zaimplementowano wszystkie operacje?

# SystemArchitectureImplemented
source: Has the full system architecture been implemented?
pl: Czy zaimplementowano pełną architekturę systemu?

# SystemWorksInAssumedEnvironment
source: Does the system work in the assumed work environment?
pl: Czy system pracuje w założonym środowisku pracy?

# InteroperabilityWithOtherSystemsImplemented
source: Has interoperability with other systems been implemented?
pl: Czy zaimplementowano współdziałanie z innymi systemami?

# UserInterfaceFullyImplemented
source: Is the user interface (all windows/dialogs) fully implemented?
pl: Czy w pełni zaimplementowano interfejs z użytkownikiem (wszystkie okna/dialogi)?

# UIFunctionalityAppropriate
source: Is the UI functionality appropriate?
pl: Czy funkcjonalność interfejsu użytkownika jest odpowiednia?

# InterfacesToOtherSystemsImplemented
source: Have the interfaces to other systems been fully implemented?
pl: Czy w pełni zaimplementowano interfejsy do innych systemów?

# ProcessingTimeAppropriate
source: Is the processing time appropriate?
pl: Czy czas przetwarzania jest odpowiedni?

# ResponseTimeAdequate
source: Is the response time adequate?
pl: Czy czas reakcji jest odpowiedni?

# ParallelProcessesUsed
source: Have parallel processes been used?
pl: Czy wykorzystano równoległe procesy?

# ParallelOperationsUsed
source: Have parallel operations been used?
pl: Czy wykorzystano równoległe operacje?

# ConcurrentUsersAppropriate
source: Is the number of users using the system at the same time appropriate?
pl: Czy liczba użytkowników jednocześnie korzystających z systemu jest odpowiednia?

# TransactionsPerUnitTimeAppropriate
source: Is the number of transactions handled per unit of time appropriate?
pl: Czy liczba transakcji obsługiwanych na jednostkę czasu jest odpowiednia?

# InitialRecordsAppropriate
source: Is the initial number of records (files) of data appropriate?
pl: Czy początkowa liczba rekordów (plików) danych jest odpowiednia?

# IncreaseInRecordsAppropriate
source: Is the increment of records (files) of data appropriate?
pl: Czy przyrost rekordów (plików) danych jest odpowiedni?

# DataVolumeAppropriate
source: Is the data volume appropriate?
pl: Czy objętość danych jest odpowiednia?

# DataArchivingImplemented
source: Have data archiving and data dearchiving been implemented?
pl: Czy zaimplementowano archiwizację danych i dearchiwizację danych?

# SystemWorksWithOptimalEquipment
source: How does the system work with equipment that meets optimal requirements?
pl: Jak system pracuje ze sprzętem spełniającym optymalne wymagania?

# SystemWorksWithMinimumEquipment
source: How does the system work with equipment that meets the minimum requirements?
pl: Jak system pracuje ze sprzętem spełniającym minimalne wymagania?

# PerformanceLossUnderOptimalConditionsAcceptable
source: Is it acceptable to lose performance under optimal conditions?
pl: Czy utrata wydajności w optymalnych warunkach jest dopuszczalna?

# SystemWorksWithOptimalSoftware
source: How does the system work with software that meets optimal requirements?
pl: Jak system pracuje z oprogramowam spełniającym optymalne wymagania?

# SystemWorksWithMinimumSoftware
source: How does the system work with software that meets the minimum requirements?
pl: Jak system pracuje z oprogramowam spełniającym minimalne wymagania?

# SystemWorksWithManyUsers
source: How does the system work with a large number of users?
pl: Jak system pracuje z dużą liczbą użytkowników?

# SystemWorksWithManyTransactions
source: How does the system work with a large number of transactions per unit of time?
pl: Jak system pracuje z dużą liczbą transakcji na jednostkę czasu?

# SystemExpandable
source: Is it possible to expand the system in this regard?
pl: Czy możliwe jest rozszerzenie systemu w tym zakresie?

# SystemWorksWithManyRecords
source: How does the system work with a large number of records (files)?
pl: Jak system pracuje z dużą liczbą rekordów (plików)?

# SystemWorksWithLargeDataVolume
source: How does the system work with a large volume of data?
pl: Jak system pracuje z dużą objętością danych?

# SystemFunctionsProperlyUnderNormalConditions
source: Is the system functioning properly under normal conditions?
pl: Czy system prawidłowo funkcjonuje w normalnych warunkach?

# ErrorCountAcceptable
source: Is the number of errors acceptable?
pl: Czy liczba błędów jest dopuszczalna?

# SystemHandlesEmergenciesCorrectly
source: Does the system handle emergencies correctly?
pl: Czy system prawidłowo obsługuje sytuacje wyjątkowe?

# EmergenciesTested
source: Have all emergencies been tested?
pl: Czy wszystkie sytuacje wyjątkowe zostały przetestowane?

# SystemHandlesCriticalSituationsCorrectly
source: Is the system handling critical situations correctly?
pl: Czy system prawidłowo obsługuje sytuacje krytyczne?

# CriticalSituationsTested
source: Have all critical situations been tested?
pl: Czy wszystkie sytuacje krytyczne zostały przetestowane?

# FailurePreventionImplemented
source: Are you in place to prevent failures?
pl: Czy zaimplementowano mechanizmy zapobiegania awariom?

# FailureEffectsMinimizationImplemented
source: Have mechanisms been implemented to minimize the effects of failures?
pl: Czy zaimplementowano mechanizmy minimalizowania skutków awarii?

# UserErrorResilienceImplemented
source: Is the system adequately resilient to user errors?
pl: Czy system jest odporny na błędy użytkownika w stopniu odpowiednim?

# UserErrorMinimizationImplemented
source: Have measures been implemented to minimize the possibility of user error?
pl: Czy zaimplementowano środki minimalizujące możliwość pomyłki użytkownika?

# DataVerificationImplemented
source: Have data verification methods been implemented?
pl: Czy zaimplementowano metody weryfikacji danych?

# DataRepairImplemented
source: Have you implemented ways to repair your data?
pl: Czy zaimplementowano sposoby naprawy danych?

# ProcessingResultsVerificationImplemented
source: Have you implemented ways to verify the processing results?
pl: Czy zaimplementowano sposoby weryfikacji wyników przetwarzania?

# ProcessingErrorsHandlingImplemented
source: Are there any ways to deal with processing errors?
pl: Czy zaimplementowano sposoby postępowania przy błędach przetwarzania?

# SecurityMethodsImplemented
source: Have security methods been implemented in this aspect?
pl: Czy zaimplementowano sposoby zabezpieczeń w tym aspekcie?

# InputValidationImplemented
source: Has input validation been implemented?
pl: Czy zaimplementowano weryfikację danych wejściowych?

# OutputValidationImplemented
source: Has output validation been implemented?
pl: Czy zaimplementowano weryfikację danych wyjściowych?

# StoredDataPreviewImplemented
source: Has the ability to preview stored data been implemented?
pl: Czy zaimplementowano możliwość podglądu danych przechowywanych?

# StoredDataVerificationImplemented
source: Has the ability to verify stored data been implemented?
pl: Czy zaimplementowano możliwość weryfikacji danych przechowywanych?

# ControlProceduresImplemented
source: Have control procedures been implemented?
pl: Czy zaimplementowano procedury kontrolne?

# TestProceduresImplemented
source: Have test procedures been implemented?
pl: Czy zaimplementowano procedury testowe?

# SystemRunsOnDifferentHardwarePlatforms
source: Can the system run on different hardware platforms?
pl: Czy system można uruchamiać na różnych platformach sprzętowych?

# SystemRunsInDifferentSoftwareEnvironments
source: Can the system run in different software environments?
pl: Czy system można uruchamiać w różnych środowiskach programowych?

# ImportFileFormatsImplemented
source: Have you implemented the import of files in all required formats?
pl: Czy zaimplementowano import plików we wszystkich wymaganych formatach?

# ExportFileFormatsImplemented
source: Has you implemented the export of files in all required formats?
pl: Czy zaimplementowano eksport plików we wszystkich wymaganych formatach?

# DataExchangeWithDifferentSystemsImplemented
source: Has the ability to exchange data with different systems been implemented?
pl: Czy zaimplementowano możliwość wymiany danych z różnymi systemami?

# WesternLanguageVersionsImplemented
source: Have language versions for Western countries been implemented?
pl: Czy zaimplementowano wersje językowe dla krajów zachodnich?

# OtherEuropeanLanguageVersionsImplemented
source: Have language versions for other European countries been implemented?
pl: Czy zaimplementowano wersje językowe dla pozostałych krajów europejskich?

# MiddleEasternLanguageVersionsImplemented
source: Have languages for Middle Eastern countries been implemented?
pl: Czy zaimplementowano wersje językowe dla krajów bliskowschodnich?

# FarEasternLanguageVersionsImplemented
source: Have language versions for Far Eastern countries been implemented?
pl: Czy zaimplementowano wersje językowe dla krajów dalekowschodnich?

# DateFormatChangeImplemented
source: Is the ability to change the date format implemented?
pl: Czy zaimplementowano możliwość zmiany formatu daty?

# TimeFormatChangeImplemented
source: Has the ability to change the time format been implemented?
pl: Czy zaimplementowano możliwość zmiany formatu czasu?

# NumberFormatChangeImplemented
source: Has the ability to change the number format been implemented?
pl: Czy zaimplementowano możliwość zmiany formatu liczb?

# CurrencySymbolChangeImplemented
source: Has the ability to change the currency symbol and its position implemented?
pl: Czy zaimplementowano możliwość zmiany symbolu waluty i jego położenia?

# QuotationMarksChangeImplemented
source: Has the ability to change quotation marks been implemented?
pl: Czy zaimplementowano możliwość zmiany cudzysłowów?

# UserMacrosImplemented
source: Has the ability to write macros (scripts) by the user been implemented?
pl: Czy zaimplementowano możliwość pisania makr (skryptów) przez użytkownika?

# MacroLanguageSpecificationCreated
source: Has a macro (scripting) language specification been created?
pl: Czy stworzono specyfikację języka makr (skryptów)?

# AddonsImplemented
source: Has the ability to introduce add-ons been implemented?
pl: Czy zaimplementowano możliwość wprowadzania dodatków?

# AddonLanguageSpecificationCreated
source: Has an add-on writing language specification been created?
pl: Czy stworzono specyfikację języka pisania dodatków?

# AddonInterfaceSpecificationCreated
source: Have you created an interface specification for add-ons?
pl: Czy stworzono specyfikację interfejsu dla dodatków?

# FileFormatChoiceImplemented
source: Is there a way to choose the format of the files to be saved?
pl: Czy zaimplementowano możliwość wyboru formatu plików zapisywanych?

# DatabaseSystemChangeImplemented
source: Has the ability to change the database system been implemented?
pl: Czy zaimplementowano możliwość zmiany systemu bazy danych?

# WindowLayoutChangeImplemented
source: Has the ability to change the layout of windows been implemented?
pl: Czy zaimplementowano możliwość zmiany układu okien?

# WindowAppearanceChangeImplemented
source: Has the ability to change the appearance of windows been implemented?
pl: Czy zaimplementowano możliwość zmiany wyglądu okien?

# UserProfileChoiceImplemented
source: Is the ability to select a user profile implemented?
pl: Czy zaimplementowano możliwość wyboru profilu użytkownika?

# MenuConfigurationImplemented
source: Is the ability to configure menus implemented?
pl: Czy zaimplementowano możliwość konfigurowania menu?

# ToolbarConfigurationImplemented
source: Is the ability to configure toolbars implemented?
pl: Czy zaimplementowano możliwość konfigurowania pasków narzędziowych?

# KeyboardShortcutsConfigurationImplemented
source: Is the ability to configure keyboard shortcuts implemented?
pl: Czy zaimplementowano możliwość konfigurowania skrótów klawiszowych?

# InstallationConfigurationImplemented
source: Has the system architecture configuration adjustment been implemented during installation?
pl: Czy zaimplementowano dopasowanie konfiguracji architektury systemu przy instalacji?

# PostInstallationConfigurationImplemented
source: Has the system architecture configuration adjustment been implemented after installation?
pl: Czy zaimplementowano dopasowanie konfiguracji architektury systemu po instalacji?

# FunctionsAdequateToProblems
source: Are the implemented functions adequate for specific problems?
pl: Czy zaimplementowane funkcje są adekwatne do określonych problemów?

# FunctionsAdequateToBenefits
source: Are the implemented functions adequate to the expected benefits?
pl: Czy zaimplementowane funkcje są adekwatne do spodziewanych korzyści?

# FunctionsAdequateToGoals
source: Are the implemented functions adequate to the goals?
pl: Czy zaimplementowane funkcje są adekwatne do celów?

# ImplementationEvaluatedByCustomer
source: Has the implementation been evaluated by the customer? How high?
pl: Czy implementacja została oceniona przez klienta? Jak wysoko?

# ImplementationEvaluatedByUsers
source: Has the implementation been evaluated by users? How high?
pl: Czy implementacja została oceniona przez użytkowników? Jak wysoko?

# WayOfWorkingStandardsCompliance
source: Is the implemented way of working compliant with the standards?
pl: Czy zaimplementowany sposób pracy jest zgodny ze standardami?

# UserHintsImplemented
source: Have user hints been implemented?
pl: Czy zaimplementowano podpowiedzi dla użytkownika?

# ExplanationsForInexperiencedUsersImplemented
source: Have explanations for inexperienced users been implemented?
pl: Czy zaimplementowano objaśnia dla niedoświadczonych użytkowników?

# SupportSystemImplemented
source: Has a support system been implemented?
pl: Czy zaimplementowano system pomocy?

# AutocompleteImplemented
source: Has autocomplete been implemented?
pl: Czy zaimplementowano autouzupełnienie?

# AutocorrectImplemented
source: Has autocorrect been implemented?
pl: Czy zaimplementowano autokorektę?

# AidSchemeScopeAppropriate
source: Is the scope of the aid scheme adequate?
pl: Czy zakres systemu pomocy jest odpowiedni?

# HintSystemScopeAppropriate
source: Is the scope of the hint system appropriate?
pl: Czy zakres systemu podpowiedzi jest odpowiedni?

# UserSupportMeasuresImplemented
source: Have user support measures been implemented?
pl: Czy zaimplementowano środki wsparcia technicznego dla użytkownika?

# WayOfWorkingConsistency
source: Is the implemented way of working consistent with the current one?
pl: Czy zaimplementowany sposób pracy jest zgodny z dotychczasowym?

# DemoImplemented
source: Has a demo been implemented?
pl: Czy zaimplementowano wersję demo?

# TrainingProgramsImplemented
source: Have training programs been implemented?
pl: Czy zaimplementowano programy uczące?

# TrainingCoursesOrganized
source: Have training courses been organized?
pl: Czy zorganizowano kursy szkoleniowe?

# AutomaticActionsImplemented
source: Is the ability to perform certain actions automatically implemented?
pl: Czy zaimplementowano możliwość automatycznego wykonywania pewnych czynności?

# UserCommandRecordingImplemented
source: Is the ability to record and repeat user commands implemented?
pl: Czy zaimplementowano możliwość rejestrowania i powtarzania poleceń użytkownika?

# CommandSequenceRecordingImplemented
source: Is the ability to record and repeat sequences of commands implemented?
pl: Czy zaimplementowano możliwość rejestrowania i powtarzania sekwencji poleceń?

# HintsImplemented
source: Have hints been implemented?
pl: Czy zaimplementowano podpowiedzi?

# AutocorrectionOrAutocompletionImplemented
source: Have autocorrects or autocompletes been implemented?
pl: Czy zaimplementowano środki autokorekty, autouzupełniania?

# FeaturesImplementedCorrectly
source: Have all the features been implemented correctly?
pl: Czy wszystkie funkcje zostały zaimplementowane poprawnie?

# UIFunctionalityCorrect
source: Does the user interface have the correct functionality?
pl: Czy interfejs użytkownika ma poprawną funkcjonalność?

# InterfacesToOtherSystemsWorking
source: Are the interfaces to other systems working properly?
pl: Czy interfejsy do innych systemów działają poprawnie?

# ImplementationTestedAndAcceptedByExperts
source: Has the implementation been tested and accepted by experts?
pl: Czy implementacja została przetestowana i zaakceptowana przez ekspertów?

# ImplementationDocumentationCreated
source: Has implementation documentation been made?
pl: Czy wykonano dokumentację implementacji?

# ImplementationDocumentationStandardsCompliance
source: Is the implementation documentation compliant with the standards?
pl: Czy dokumentacja implementacji jest zgodna ze standardami?

# ImplementationDocumentationUnderstandable
source: Is the implementation documentation understandable?
pl: Czy dokumentacja implementacji jest zrozumiała?

# TestDocumentationProvided
source: Have test documentation been provided?
pl: Czy przedstawiono dokumentację testów?

# FunctionsPerformedConsistentlyAcrossModules
source: Are the functions performed in the same way in different modules?
pl: Czy funkcje są wykonywane w ten sam sposób w różnych modułach?

# InterfaceLookConsistentAcrossModules
source: Is the interface look the same in different modules?
pl: Czy wygląd interfejsu w różnych modułach jest taki sam?

# InterfaceFunctionalityConsistentAcrossModules
source: Is the functionality of the interface in different modules the same?
pl: Czy funkcjonalność interfejsu w różnych modułach jest taka sama?

# FunctionalAndPerformanceRequirementsReconciled
source: How were functional and performance requirements reconciled?
pl: Jak pogodzono wymagania funkcjonalne z wydajnościowymi?

# PerformanceAndReliabilityRequirementsReconciled
source: How were performance and reliability requirements reconciled?
pl: Jak pogodzono wymagania wydajnościowe z wiarygodnościowymi?

# PerformanceRequirementsReconciledWithFlexibility
source: How are performance requirements reconciled with the required flexibility?
pl: Jak pogodzono wymagania wydajnościowe z wymaganą elastycznością?

# FunctionImplementationUnderstandable
source: Is the way the function is implemented understandable?
pl: Czy sposób implementacji funkcji jest zrozumiały?

# InterfaceSetupFacilitatesUnderstanding
source: Does the way the interface is set up make it easier to understand the functionality?
pl: Czy sposób ustawienia interfejsu ułatwia zrozumienie funkcjonalności?

# ImplementationModular
source: Was the implementation done in a modular way?
pl: Czy implementacja została wykonana w sposób modularny?

# ModuleDependenciesAppropriate
source: Are the dependencies between modules appropriate?
pl: Czy zależności między modułami są odpowiednie?

# ExecutionModulesUsed
source: Are execution modules used?
pl: Czy zastosowano moduły wykonawcze?

# ExecutionModuleDivisionAppropriate
source: Is the division into executive modules appropriate?
pl: Czy podział na moduły wykonawcze jest odpowiedni?

# ExecutionModuleDependenciesAppropriate
source: Are the dependencies between the execution modules appropriate?
pl: Czy zależności między modułami wykonawczymi są odpowiednie?

# SourceCodeAvailable
source: Is the source code available?
pl: Czy kod źródłowy jest dostępny?

# SourceCodeConsistentWithDocumentation
source: Is the source code consistent with the documentation?
pl: Czy kod źródłowy jest zgodny z dokumentacją?

# SourceCodeFormattedToStandards
source: Is the source code formatted according to standards?
pl: Czy kod źródłowy jest sformatowany zgodnie ze standardami?

# SourceCodeUnderstandable
source: Is the source code understandable?
pl: Czy kod źródłowy jest zrozumiały?

# ImplementationLinkedToProject
source: Is the implementation linked to the project?
pl: Czy powiązano implementację z projektem?

# ImplementationLinkedToRequirements
source: Is the implementation linked to the requirements specification?
pl: Czy powiązano implementację ze specyfikacją wymagań?

# ImplementedFunctionsInterconnected
source: Have the implemented functions been properly interconnected?
pl: Czy zaimplementowane funkcje zostały odpowiednio wzajemnie powiązane?

# FunctionalImplementationsLinked
source: Have functional implementations been linked to functional implementations?
pl: Czy implementacje funkcjonalne zostały powiązane z funkcjonalnymi?

# FunctionalImplementationsInterrelated
source: Are the functional implementations interrelated?
pl: Czy implementacje funkcjonalne zostały wzajemnie powiązane?

# InputOutputConditionsSpecified
source: Are the input and output conditions of the operation specified
pl: Czy określono warunki wejściowe i wyjściowe operacji

# ProcessInputOutputConditionsSpecified
source: Have the input and output conditions of the processes been specified?
pl: Czy określono warunki wejściowe i wyjściowe procesów?

# EmergencyTestingPossible
source: Is there a specific way to test for emergencies?
pl: Czy określono sposób testowania sytuacji wyjątkowych?

# CriticalSituationTestingPossible
source: Is it possible to test critical situations?
pl: Czy możliwe jest testowanie sytuacji krytycznych?

# EmergencySituationTestingPossible
source: Is it possible to test emergency situations?
pl: Czy możliwe jest testowanie sytuacji awaryjnych?

# UserInterfaceRequirementsStandardCompliance
source: Have requirements been defined for interface compliance with standards?
pl: Czy określono wymagania na zgodność interfejsu ze standardami?
