Repository: qhta/Quest
Catalog: QuestRSX/MeasureStrings.*.resx
Languages: pl

# GoalsDefined
source: Have the goals of the system been defined? How exactly?
pl: Czy cele systemu zostały zdefiniowane? Jak dokładnie?

# ProblemsDefined
source: Have the problems been defined? How exactly?
pl: Czy problemy zostały zdefiniowane? Jak dokładnie?

# BenefitsDefined
source: Have the benefits been defined? How exactly?
pl: Czy korzyści zostały zdefiniowane? Jak dokładnie?

# BasicShareholdersDefined
source: Have the basic shareholders been defined? How exhaustive?
pl: Czy zdefiniowano podstawowych udziałowców? Na ile wyczerpująco?

# AdditionalShareholdersDefined
source: Have additional shareholders been defined? How exhaustive?
pl: Czy zdefiniowano dodatkowych udziałowców? Na ile wyczerpująco?

# ExternalShareholdersDefined
source: Are external shareholders defined? How exhaustive?
pl: Czy zdefiniowano udziałowców zewnętrznych? Na ile wyczerpująco?

# CoreUsersDetermined
source: Have the core users been determined? How exhaustive?
pl: Czy podstawowi użytkownicy zostali określeni? Na ile wyczerpująco?

# AdditionalUsersIdentified
source: Have additional users been identified? How exhaustive?
pl: Czy dodatkowi użytkownicy zostali określeni? Na ile wyczerpująco?

# UserTasksSpecified
source: Have user tasks been specified? How exactly?
pl: Czy zostały określone zadania użytkowników? Na ile dokładnie?

# RequiredFunctionsDefined
source: Have all the required functions been defined? How exhaustive?
pl: Czy zdefiniowano wszystkie wymagane funkcje? Na ile wyczerpująco?

# FeatureDescriptionsComplete
source: Does each feature have a complete description? How exhaustive?
pl: Czy każda funkcja ma kompletny opis? Na ile wyczerpujący?

# FeaturesAssignedToUsers
source: Have the features been properly assigned to users?
pl: Czy funkcje zostały poprzypisywane do użytkowników? Na ile precyzyjnie?

# InputsDefined
source: Have inputs been defined? How precisely?
pl: Czy zdefiniowano dane wejściowe? Na ile precyzyjnie?

# OutputDefined
source: Is the output defined? How precisely?
pl: Czy zdefiniowano dane wyjściowe? Na ile precyzyjnie?

# StoredDataDefined
source: Is stored data defined? How precisely?
pl: Czy zdefiniowano dane przechowywane? Na ile precyzyjnie?

# DataProcessingMethodsDefined
source: Are the methods of data processing defined? How precisely?
pl: Czy zdefiniowano sposoby przetwarzania danych? Na ile precyzyjnie?

# CoreProcessesDefined
source: Have the core processes been defined? How exactly?
pl: Czy zdefiniowano podstawowe procesy? Na ile dokładnie?

# BasicOperationsDefined
source: Are basic operations defined? In how much detail?
pl: Czy zdefiniowano podstawowe operacje? Na ile szczegółowo?

# SystemArchitectureSpecified
source: Is the system architecture specified? In how much detail?
pl: Czy określono architekturę systemu? Na ile szczegółowo?

# OperatingEnvironmentSpecified
source: Is the operating environment of the system specified? How precisely?
pl: Czy określono środowisko pracy systemu? Na ile precyzyjnie?

# InteroperableSystemsDefined
source: Are there any other interoperable systems? How exhaustive?
pl: Czy określono inne systemy współdziałające? Na ile wyczerpująco?

# UserInteractionDefined
source: Is there a way to interact with the user? How precisely?
pl: Czy określono sposób interakcji z użytkownikiem? Na ile precyzyjnie?

# UserInterfaceExampleShown
source: Is the user interface example shown? In how much detail?
pl: Czy pokazano przykład interfejsu użytkownika? Na ile szczegółowo?

# InterfacesToOtherSystemsDefined
source: Are there any interfaces to other systems? How precisely?
pl: Czy określono interfejsy do innych systemów? Na ile precyzyjnie?

# ProcessingTimeRequirements
source: Are there requirements for processing time?
pl: Czy określono wymagania na czas przetwarzania?

# ResponseTimeRequirements
source: Are there any requirements for response time?
pl: Czy określono wymagania na czas reakcji?

# ParallelProcessesIdentified
source: Have potentially parallel processes been identified?
pl: Czy określono potencjalnie równoległe procesy?

# ParallelOperationsIdentified
source: Have potentially parallel operations been identified?
pl: Czy określono potencjalnie równoległe operacje?

# ConcurrentUsersEstimated
source: Has the number of users using the system at the same time been estimated?
pl: Czy oszacowano liczbę użytkowników jednocześnie korzystających z systemu?

# TransactionsPerUnitTimeEstimated
source: Have you estimated the number of transactions per unit of time?
pl: Czy oszacowano liczbę transakcji na jednostkę czasu?

# InitialRecordsEstimated
source: Has the initial number of records (files) been estimated?
pl: Czy oszacowano początkową liczbę rekordów (plików) danych?

# IncreaseInRecordsEstimated
source: Has the increase in records (files) of data been estimated?
pl: Czy oszacowano przyrost rekordów (plików) danych?

# DataVolumeEstimated
source: Has the volume of data been estimated?
pl: Czy oszacowano objętość danych?

# DataArchivingPlanned
source: Is data archiving planned?
pl: Czy przewidziano archiwizację danych?

# OptimalEquipmentRequirementsDetermined
source: Have the optimal requirements for the equipment been determined?
pl: Czy określono optymalne wymagania na sprzęt?

# MinimumHardwareRequirements
source: Are there minimum requirements for the hardware?
pl: Czy określono minimalne wymagania na sprzęt?

# PerformanceLossUnderSuboptimalConditions
source: Has the permissible loss of performance under suboptimal conditions been determined?
pl: Czy określono dopuszczalną utratę wydajności w nieoptymalnych warunkach?

# OptimalSoftwareRequirementsDetermined
source: Have the optimal requirements for the software been determined?
pl: Czy określono optymalne wymagania na oprogramowanie?

# MinimumSoftwareRequirements
source: Are there minimum requirements for the software?
pl: Czy określono minimalne wymagania na oprogramowanie?

# MaximumUsersEstimated
source: Has the maximum number of users been estimated?
pl: Czy oszacowano maksymalną dopuszczalną liczbę użytkowników?

# MaximumTransactionsPerUnitTimeEstimated
source: Has the maximum number of transactions per unit of time been estimated?
pl: Czy oszacowano maksymalną dopuszczalną liczbę transakcji na jednostkę czasu?

# SystemExpansionPlanned
source: Is it planned to expand the system when the maximum values are exceeded?
pl: Czy przewidziano rozszerzanie systemu przy przekroczeniu wartości maksymalnych?

# MaximumRecordsEstimated
source: Has the maximum number of records (files) been estimated?
pl: Czy oszacowano maksymalną liczbę rekordów (plików) danych?

# MaximumDataVolumeEstimated
source: Has the maximum data volume been estimated?
pl: Czy oszacowano maksymalną objętość danych?

# EmergencySituationsDefined
source: Are there any emergency situations?
pl: Czy przewidziano sytuacje wyjątkowe?

# EmergencyResponsesDefined
source: Have emergency responses been defined?
pl: Czy określono reakcje na sytuacje wyjątkowe?

# CriticalSituationsForeseen
source: Are critical situations foreseen?
pl: Czy przewidziano sytuacje krytyczne?

# CriticalResponsesSpecified
source: Have critical responses been specified?
pl: Czy określono reakcje na sytuacje krytyczne?

# FailurePreventionDefined
source: Is there a way to prevent failures?
pl: Czy określono sposób zapobiegania awariom?

# FailureEffectsMinimized
source: Has there been a way to minimize the effects of failures?
pl: Czy określono sposób minimalizowania skutków awarii?

# UserFaultToleranceLevelSpecified
source: Is the required level of user fault tolerance specified?
pl: Czy określono wymagany poziom odporności na błędy użytkownika?

# UserErrorMinimizationMeasures
source: Are there measures in place to minimize the possibility of user error?
pl: Czy określono środki minimalizujące możliwość pomyłki użytkownika?

# DataVerificationMethods
source: Are there any specific methods for verifying your data?
pl: Czy określono metody weryfikacji danych?

# DataRepairMethods
source: Are there any specific ways to repair the data?
pl: Czy określono sposoby naprawy danych?

# ProcessingResultsVerification
source: Are there any ways to verify the processing results?
pl: Czy określono sposoby weryfikacji wyników przetwarzania?

# ProcessingErrorsHandling
source: Are there any ways to deal with processing errors?
pl: Czy określono sposoby postępowania przy błędach przetwarzania?

# SystemThreatsToUsersIdentified
source: Have you identified threats from the system to the user?
pl: Czy zidentyfikowano zagrożenia ze strony systemu dla użytkownika?

# RiskAssessmentPerformed
source: Has the risk been assessed in this aspect?
pl: Czy oceniono ryzyko w tym aspekcie?

# SecurityMeasuresDefined
source: Are there any security measures in this aspect?
pl: Czy określono sposoby zabezpieczeń w tym aspekcie?

# SystemThreatsToOtherSystemsIdentified
source: Have system threats to other systems been identified?
pl: Czy zidentyfikowano zagrożenia ze strony systemu dla innych systemów?

# UserThreatsToSystemIdentified
source: Have threats to the system been identified from users?
pl: Czy zidentyfikowano zagrożenia dla systemu ze strony użytkowników?

# OtherSystemThreatsToSystemIdentified
source: Have you identified threats to your system from other systems?
pl: Czy zidentyfikowano zagrożenia dla systemu ze strony innych systemów?

# InputDataVerification
source: Is there a verification of input data?
pl: Czy przewidziano weryfikację danych wejściowych?

# OutputVerification
source: Is there a verification of the output?
pl: Czy przewidziano weryfikację danych wyjściowych?

# StoredDataPreview
source: Is it possible to view the stored data?
pl: Czy przewidziano możliwość podglądu danych przechowywanych?

# StoredDataVerification
source: Is it possible to verify the stored data?
pl: Czy przewidziano możliwość weryfikacji danych przechowywanych?

# ControlProceduresDefined
source: Are there any control procedures?
pl: Czy przewidziano procedury kontrolne?

# TestProceduresDefined
source: Are there any test procedures?
pl: Czy przewidziano procedury testowe?

# HardwarePlatformDefined
source: Is there a hardware platform on which the system will run?
pl: Czy określono platformę sprzętową, na których będzie uruchamiany system?

# DifferentHardwarePlatformsSupported
source: Is it possible to run on different hardware platforms?
pl: Czy przewidziano możliwość uruchamiania na różnych platformach sprzętowych?

# SpecificOperatingSystemDefined
source: Is there a specific operating system on which the system will run?
pl: Czy określono system operacyjny, na którym będzie uruchamiany system?

# DifferentOperatingSystemsSupported
source: Is it possible to run on different operating systems?
pl: Czy przewidziano możliwość uruchamiania na różnych systemach operacyjnych?

# ImportFileFormatsSpecified
source: Are import file formats specified?
pl: Czy określono formaty plików importowanych?

# ExportFileFormatsSpecified
source: Are there any export file formats specified?
pl: Czy określono formaty plików eksportowanych?

# DatabaseSystemsSpecified
source: Are acceptable (different) database systems specified?
pl: Czy określono akceptowalne (różne) systemy bazy danych?

# WesternLanguageVersionsSpecified
source: Are there language versions for Western countries? How much?
pl: Czy przewidziano wersje językowe dla krajów zachodnich? Ile?

# OtherEuropeanLanguageVersionsSpecified
source: Are there language versions for other European countries? How much?
pl: Czy przewidziano wersje językowe dla pozostałych krajów europejskich? Ile?

# MiddleEasternLanguageVersionsSpecified
source: Are there language versions for Middle Eastern countries? How much?
pl: Czy przewidziano wersje językowe dla krajów bliskowschodnich? Ile?

# FarEasternLanguageVersionsSpecified
source: Are there language versions for the Far Eastern countries? How much?
pl: Czy przewidziano wersje językowe dla krajów dalekowschodnich? Ile?

# DateFormatChangeSupported
source: Is there a change in the date format?
pl: Czy przewidziano zmianę formatu daty?

# TimeFormatChangeSupported
source: Is there a change in the time format?
pl: Czy przewidziano zmianę formatu czasu?

# NumberFormatChangeSupported
source: Is there a change in the number format?
pl: Czy przewidziano zmianę formatu liczb?

# CurrencySymbolChangeSupported
source: Is there a change in the currency symbol and its position?
pl: Czy przewidziano zmianę symbolu waluty i jego położenia?

# QuotationMarksChangeSupported
source: Is there a change in quotation marks?
pl: Czy przewidziano zmianę cudzysłowów?

# UserMacrosSupported
source: Is it possible for the user to write macros (scripts)?
pl: Czy przewidziano możliwość pisania makr (skryptów) przez użytkownika?

# MacroLanguageSpecified
source: Is the macro (script) language specified?
pl: Czy określono język makr (skryptów)?

# AddonsSupported
source: Is there a possibility of introducing additives?
pl: Czy przewidziano możliwość wprowadzania dodatków?

# AddonLanguageSpecified
source: Is there a specific language for writing add-ons?
pl: Czy określono język pisania dodatków?

# AddonInterfaceSpecified
source: Is there an interface for add-ons?
pl: Czy określono interfejs dla dodatków?

# FileFormatChoiceSupported
source: Is there a choice of file format?
pl: Czy przewidziano możliwość wyboru formatu plików?

# DatabaseSystemChangeSupported
source: Is there a possibility to change the database system?
pl: Czy przewidziano możliwość zmiany systemu bazy danych?

# WindowLayoutChangeSupported
source: Is it possible to change the layout of the windows?
pl: Czy przewidziano możliwość zmiany układu okien?

# WindowAppearanceChangeSupported
source: Is it possible to change the appearance of windows?
pl: Czy przewidziano możliwość zmiany wyglądu okien?

# UserProfileChoiceSupported
source: Is there a possibility to choose a user profile?
pl: Czy przewidziano możliwość wyboru profilu użytkownika?

# MenuConfigurationSupported
source: Is there a way to configure menus?
pl: Czy przewidziano możliwość konfigurowania menu?

# ToolbarConfigurationSupported
source: Is there a way to configure toolbars?
pl: Czy przewidziano możliwość konfigurowania pasków narzędziowych?

# KeyboardShortcutsConfigurationSupported
source: Is there a way to configure keyboard shortcuts?
pl: Czy przewidziano możliwość konfigurowania skrótów klawiszowych?

# InstallationConfigurationSupported
source: Is there a system architecture configuration to be adjusted during installation?
pl: Czy przewidziano dopasowanie konfiguracji architektury systemu przy instalacji?

# PostInstallationConfigurationSupported
source: Is there a system architecture configuration adjustment after installation?
pl: Czy przewidziano dopasowanie konfiguracji architektury systemu po instalacji?

# GoalsAdequateToProblems
source: Are the goals adequate to the problems?
pl: Czy cele są adekwatne do problemów?

# GoalsAdequateToBenefits
source: Are the goals adequate to the benefits?
pl: Czy cele są adekwatne do korzyści?

# FeaturesFitForPurpose
source: Are the features fit for purpose?
pl: Czy funkcje są adekwatne do celów?

# RequirementsEvaluatedByCustomer
source: Have the requirements been evaluated by the customer? How high?
pl: Czy wymagania zostały ocenione przez klienta? Jak wysoko?

# RequirementsEvaluatedByUsers
source: Have the requirements been evaluated by future users? How high?
pl: Czy wymagania zostały ocenione przez przyszłych użytkowników? Jak wysoko?

# RequirementsEvaluatedByContractors
source: Have the requirements been assessed by the contractors? How high?
pl: Czy wymagania zostały ocenione przez wykonawców? Jak wysoko?

# InterfaceStandardsCompliance
source: Is the implemented interface compliant with the standards?
pl: Czy zaimplementowany interfejs jest zgodny ze standardami?

# ExpectedWayOfWorkingStandardsCompliance
source: Is the expected way of working up to standards?
pl: Czy przewidywany sposób pracy jest zgodny ze standardami?

# UserHintsProvided
source: Are there any hints for the user?
pl: Czy przewidziano podpowiedzi dla użytkownika?

# ExplanationsForInexperiencedUsers
source: Are there explanations for inexperienced users?
pl: Czy przewidziano objaśnienia dla niedoświadczonych użytkowników?

# AssistanceSystemProvided
source: Is there a system of assistance?
pl: Czy przewidziano system pomocy?

# AutofillProvided
source: Is autofill provided?
pl: Czy przewidziano autouzupełnienie?

# AutocorrectProvided
source: Is there an autocorrect?
pl: Czy przewidziano autokorektę?

# AidSchemeScopeDefined
source: Has the scope of the aid scheme been defined?
pl: Czy określono zakres systemu pomocy?

# HintSystemScopeDefined
source: Is the scope of the hint system specified?
pl: Czy określono zakres systemu podpowiedzi?

# TechnicalSupportProvided
source: Is there any technical support for the user?
pl: Czy przewidziano wsparcie techniczne dla użytkownika?

# ExpectedWayOfWorkingConsistency
source: Is the expected way of working consistent with the current way of working?
pl: Czy przewidywany sposób pracy jest zgodny z dotychczasowym sposobem pracy?

# DemoVersionPlanned
source: Is it planned to produce a demo version?
pl: Czy przewiduje się wyprodukowanie wersji demo?

# TeachingProgramsPlanned
source: Are there any plans to produce teaching programs?
pl: Czy przewiduje się wyprodukowanie programów uczących?

# TrainingCoursesPlanned
source: Are training courses planned?
pl: Czy przewiduje się kursy szkoleniowe?

# AutomaticActivitiesSupported
source: Is it possible to perform certain activities automatically?
pl: Czy przewidziano możliwość automatycznego wykonywania pewnych czynności?

# UserCommandRecordingSupported
source: Is there a possibility to record and repeat user commands?
pl: Czy przewidziano możliwość rejestrowania i powtarzania poleceń użytkownika?

# CommandSequenceRecordingSupported
source: Is there a possibility of recording and repeating a sequence of commands?
pl: Czy przewidziano możliwość rejestrowania i powtarzania sekwencji poleceń?

# HintsProvided
source: Are there hints?
pl: Czy przewidziano podpowiedzi?

# AutocorrectionOrAutocompletionProvided
source: Are there any means of autocorrection or autocompletion?
pl: Czy przewidziano środki autokorekty, autouzupełniania?

# KeyboardShortcutsImplemented
source: Have keyboard shortcuts been implemented?
pl: Czy zaimplementowano skróty klawiszowe?

# MouseFunctionalityImplemented
source: Have you implemented the appropriate mouse functionality?
pl: Czy zaimplementowano odpowiednią funkcjonalność myszy?

# RequirementsSpecificationStandardsCompliance
source: Was the requirements specification made in accordance with the standards?
pl: Czy specyfikację wymagań wykonano zgodnie ze standardami?

# RequirementsSeparatedFromDesignDecisions
source: Have requirements been separated from design decisions (proposals)?
pl: Czy oddzielono wymagania od decyzji (propozycji) projektowych?

# PrototypeCreated
source: Has a prototype been made?
pl: Czy wykonano prototyp?

# RequirementsAnalyzedAndAcceptedByCustomer
source: Have the requirements been analyzed and accepted by the customer?
pl: Czy wymagania zostały przeanalizowane i zaakceptowane przez klienta?

# RequirementsAcceptedByUsers
source: Have the requirements been accepted by users?
pl: Czy wymagania zostały zaakceptowane przez użytkowników?

# RequirementsAnalyzedAndAcceptedByContractor
source: Have the requirements been analysed and accepted by the contractor?
pl: Czy wymagania zostały przeanalizowane i zaakceptowane przez wykonawcę?

# GoalsInternallyConsistent
source: Are the declared goals internally consistent?
pl: Czy deklarowane cele są wewnętrznie spójne?

# RequirementsConsistentWithGoals
source: Are the requirements consistent with the goals?
pl: Czy wymagania są spójne z celami?

# RequiredFeaturesInternallyConsistent
source: Are the required features internally consistent?
pl: Czy wymagane funkcje są wewnętrznie spójne?

# FunctionalRequirementsNotInConflictWithPerformance
source: Are functional requirements not in conflict with performance requirements?
pl: Czy wymagania funkcjonalne są niesprzeczne z wydajnościowymi?

# PerformanceRequirementsNotInConflictWithCredibility
source: Are performance requirements not in conflict with credibility requirements?
pl: Czy wymagania wydajnościowe są niesprzeczne z wiarygodnościowymi?

# PerformanceRequirementsNotInConflictWithFlexibility
source: Are the performance requirements not in conflict with the required flexibility?
pl: Czy wymagania wydajnościowe są niesprzeczne z wymaganą elastycznością?

# RequirementDescriptionsComplete
source: Does each requirement have a description?
pl: Czy każde wymaganie ma opis?

# RequirementDescriptionsShort
source: Are the requirements descriptions short?
pl: Czy opisy wymagań są krótkie?

# VocabularyUnderstandable
source: Is the vocabulary in the descriptions understandable?
pl: Czy słownictwo w opisach jest zrozumiałe?

# GlossaryIncluded
source: Has a glossary been included? Is it useful?
pl: Czy słownik pojęć został zamieszczony? Czy jest przydatny?

# SynonymsAndAbbreviationsLimited
source: Is the use of synonyms and abbreviations limited?
pl: Czy stosowanie synonimów i skrótów jest ograniczone?

# GraphicalExplanationsForComplexDescriptions
source: Do more complicated descriptions have additional graphical explanation?
pl: Czy bardziej skomplikowane opisy mają dodatkowe wyjaśnienie graficzne?

# ExternalInformationSourcesReferenced
source: Are the necessary external sources of information referenced?
pl: Czy podaje się odwołania do koniecznych zewnętrznych źródeł informacji?

# FunctionalRequirementsLeaveRoomForContractor
source: Do functional requirements leave room for the contractor?
pl: Czy wymagania funkcjonalne zostawiają pole swobody dla wykonawcy?

# NonFunctionalRequirementsLeaveRoomForContractor
source: Do non-functional requirements leave room for the contractor?
pl: Czy wymagania niefunkcjonalne zostawiają pole swobody dla wykonawcy?

# ExecutivesAmongShareholders
source: Are there executives among the shareholders?
pl: Czy wśród udziałowców jest kadra kierownicza?

# ExecutivesSetGoals
source: Have executives set goals?
pl: Czy kadra kierownicza określiła cele?

# GoalsAccepted
source: Have all the goals been accepted?
pl: Czy wszystkie cele zostały zaakceptowane?

# ContractAllowsClientRequirementRenegotiation
source: Does the contract specify the possibility of renegotiating the client's requirements?
pl: Czy kontrakt określa możliwość renegocjacji wymagań ze strony klienta?

# ContractAllowsContractorRequirementRenegotiation
source: Does the contract specify the possibility of renegotiating the requirements on the part of the contractor?
pl: Czy kontrakt określa możliwość renegocjacji wymagań ze strony wykonawcy?

# GoalsLinkedToShareholders
source: Have the goals been linked to shareholders?
pl: Czy cele zostały powiązane z udziałowcami?

# RequirementsLinkedToGoals
source: Are the requirements linked to the goals?
pl: Czy wymagania zostały powiązane z celami?

# FunctionalRequirementsInterrelated
source: Are the functional requirements interrelated?
pl: Czy wymagania funkcjonalne zostały wzajemnie powiązane?

# FunctionalRequirementsLinkedToNonFunctional
source: Have functional requirements been linked to non-functional ones?
pl: Czy wymagania funkcjonalne zostały powiązane z niefunkcjonalnymi?

# NonFunctionalRequirementsInterrelated
source: Are non-functional requirements interrelated?
pl: Czy wymagania niefunkcjonalne zostały wzajemnie powiązane?

# FunctionalRequirementsNumbered
source: Have the functional requirements been numbered (identified with identifiers)?
pl: Czy wymagania funkcjonalne zostały ponumerowane (oznaczone identyfikatorami)?
