Repository: qhta/Quest
Catalog: QuestRSX/MetricsStrings.*.resx
Languages: pl

source: Functionality
pl: Funkcjonalność

source: Usability completeness
pl: Kompletność użytkowa

source: Completeness of goal definitions
pl: Kompletność definicji celów

source: Completeness of shareholders definition
pl: Kompletność definicji udziałowców

source: Completeness of user definitions
pl: Kompletność definicji użytkowników

source: Functional completeness
pl: Kompletność funkcjonalna

source: Completeness of function definitions
pl: Kompletność definicji funkcji

source: Completeness of data definitions
pl: Kompletność definicji danych

source: Completeness of processing definitions
pl: Kompletność definicji przetwarzania

source: System completeness
pl: Kompletność systemowa

source: Completeness of system definition
pl: Kompletność definicji systemu

source: Completeness of interface definitions
pl: Kompletność definicji interfejsów

source: Efficiency
pl: Wydajność

source: Processing efficiency
pl: Efektywność przetwarzania

source: Execution time
pl: Czas wykonania

source: Leveraging parallelism
pl: Wykorzystanie równoległości

source: Load capacity
pl: Obciążalność

source: Payload
pl: Obciążalność użytkowa

source: Data size
pl: Rozmiar danych

source: Stability
pl: Stabilność

source: Hardware stability
pl: Stabilność sprzętowa

source: Software stability
pl: Stabilność programowa

source: Scalability
pl: Skalowalność

source: Usable scalability
pl: Skalowalność użytkowa

source: Data scalability
pl: Skalowalność danych

source: Credibility
pl: Wiarygodność

source: Reliability
pl: Niezawodność

source: Exceptional situations
pl: Sytuacje wyjątkowe

source: Critical situations
pl: Sytuacje krytyczne

source: Failures
pl: Awarie

source: Fault tolerance
pl: Odporność na błędy

source: User errors
pl: Błędy użytkownika

source: Data errors
pl: Błędy danych

source: Processing errors
pl: Błędy przetwarzania

source: Safety
pl: Bezpieczeństwo

source: Risks to user
pl: Zagrożenia dla użytkownika

source: Threats to other systems
pl: Zagrożenia dla innych systemów

source: Protection
pl: Ochrona

source: User risks
pl: Zagrożenia ze strony użytkowników

source: Threats from other systems
pl: Zagrożenia ze strony innych systemów

source: Testability
pl: Testowalność

source: Data testability
pl: Testowalność danych

source: Processing testability
pl: Testowalność przetwarzania

source: Flexibility
pl: Elastyczność

source: Portability
pl: Przenośność

source: Hardware portability
pl: Przenośność sprzętowa

source: Software portability
pl: Przenośność programowa

source: Data portability
pl: Przenośność danych

source: Localizability
pl: Lokalizowalność

source: Languages supported
pl: Wersje językowe

source: System settings
pl: Ustawienia systemowe

source: User modifiability
pl: Modyfikowalność przez użytkownika

source: Modifiability by it specialists
pl: Modyfikowalność przez informatyków

source: Data modifiability
pl: Modyfikowalność danych

source: Configurability
pl: Konfigurowalność

source: Presentation customizability
pl: Konfigurowalność prezentacji

source: Navigation configurability
pl: Konfigurowalność nawigacji

source: Installation configurability
pl: Konfigurowalność instalacji

source: Adequacy
pl: Adekwatność

source: Expediency
pl: Celowość

source: Acceptance
pl: Akceptacja

source: Ease of use
pl: Łatwość użycia

source: User assistance
pl: Pomoc dla użytkownika

source: Ease of learning
pl: Łatwość nauki

source: Compatibility with experience
pl: Zgodność z doświadczeniem

source: Training
pl: Szkolenia

source: Productivity
pl: Produktywność

source: Automation
pl: Automatyzacja

source: Interface measures
pl: Środki interfejsowe

source: Formal correctness
pl: Poprawność formalna

source: Acceptability
pl: Akceptowalność

source: Consistency of goals and requirements
pl: Spójność celów i wymagań

source: Clarity of descriptions
pl: Zrozumiałość opisów

source: Additional descriptions
pl: Opisy dodatkowe

source: Flexibility of requirements
pl: Elastyczność wymagań

source: Immutability of goals
pl: Niezmienność celów

source: Contractual collateral
pl: Zabezpieczenia kontraktowe

source: Sources of requirements
pl: Źródła wymagań

source: Requirement bindings
pl: Powiązania wymagań

source: Ease of appeal in further work
pl: Łatwość odwołania w dalszej pracy

source: Specificity of requirements
pl: Konkretność wymagań

source: Requirements testability
pl: Testowalność wymagań

source: Class model completeness
pl: Kompletność modelu klas

source: Completeness of class definitions
pl: Kompletność definicji klas

source: Class identification completeness
pl: Kompletność identyfikacji klas

source: Completeness of class property identification
pl: Kompletność identyfikacji właściwości klas

source: Completeness of class capability identification
pl: Kompletność identyfikacji możliwości klas

source: Completeness of class property definitions
pl: Kompletność definicji właściwości klas

source: Completeness of class capability definitions
pl: Kompletność definicji możliwości klas

source: Completeness of type definitions
pl: Kompletność definicji typów

source: Completeness of relationship definitions
pl: Kompletność definicji relacji

source: Class generalization completeness
pl: Kompletność generalizacji klas

source: Completeness of aggregation declarations
pl: Kompletność deklaracji agregacji

source: Completeness of association declaration
pl: Kompletność deklaracji asocjacji

source: Specification completeness
pl: Kompletność specyfikacji

source: Class specification completeness
pl: Kompletność specyfikacji klas

source: Completeness of property specification
pl: Kompletność specyfikacji właściwości

source: Completeness of capability specification
pl: Kompletność specyfikacji możliwości

source: Completeness of relationship specification
pl: Kompletność specyfikacji relacji

source: Semantic correctness
pl: Poprawność semantyczna

source: Internal consistency of class model
pl: Spójność wewnętrzna modelu klas

source: Consistency of class model and requirements specifications
pl: Spójność modelu klas i specyfikacji wymagań

source: Nomenclature
pl: Nazewnictwo

source: Type flexibility
pl: Elastyczność typów

source: Relationship flexibility
pl: Elastyczność relacji

source: Formal modifiability
pl: Modyfikowalność formalna

source: Origin
pl: Źródła

source: Ease of reference
pl: Łatwość referencji

source: Completeness of use case model
pl: Kompletność modelu przypadków użycia

source: Completeness of actors
pl: Kompletność aktorów

source: Completeness of actor identification
pl: Kompletność identyfikacji aktorów

source: Completeness of use case definitions
pl: Kompletność definicji przypadków użycia

source: Completeness of use case identification
pl: Kompletność identyfikacji przypadków użycia

source: Completeness of actor generalizations
pl: Kompletność generalizacji aktorów

source: Completeness of generalization of use cases
pl: Kompletność generalizacji przypadków użycia

source: Completeness of use case incorporating
pl: Kompletność zawierania przypadków użycia

source: Completeness of use case extension
pl: Kompletność rozszerzania przypadków użycia

source: Completeness of actor specifications
pl: Kompletność specyfikacji aktorów

source: Completeness of use case specifications
pl: Kompletność specyfikacji przypadków użycia

source: Internal consistency of use case model
pl: Spójność wewnętrzna modelu przypadków użycia

source: Consistency of use case model and requirements specifications
pl: Spójność modelu przypadków użycia i specyfikacji wymagań

source: Consistency of functional model and class model
pl: Spójność modelu funkcjonalnego i modelu klas

source: Completeness of interaction model
pl: Kompletność modelu interakcji

source: Completeness of interactions
pl: Kompletność interakcji

source: Completeness of interaction identification
pl: Kompletność identyfikacji interakcji

source: Completeness of interaction stakeholders
pl: Kompletność udziałowców interakcji

source: Completeness of messages
pl: Kompletność komunikatów

source: Completeness of message identification
pl: Kompletność identyfikacji komunikatów

source: Completeness of flow
pl: Kompletność przepływu

source: Completeness of interaction specifications
pl: Kompletność specyfikacji interakcji

source: Internal consistency of interaction model
pl: Spójność wewnętrzna modelu interakcji

source: Consistency of interaction model and use case model
pl: Spójność modelu interakcji i modelu przypadków użycia

source: Consistency of interaction model and requirements specification
pl: Spójność modelu interakcji i specyfikacji wymagań

source: Consistency of interaction model and class model
pl: Spójność modelu interakcji i modelu klas

source: Consistency of interaction model and behavioral model
pl: Spójność modelu interakcji i modelu behawioralnego

source: Consistency of interaction model and dynamic model
pl: Spójność modelu interakcji i modelu dynamicznego

source: Activity model completeness
pl: Kompletność modelu aktywności

source: Completeness of definition
pl: Kompletność definicji

source: Completeness of activity identification
pl: Kompletność identyfikacji aktywności

source: Completeness of liability identification
pl: Kompletność identyfikacji odpowiedzialności

source: Completeness of activity specifications
pl: Kompletność specyfikacji aktywności

source: Internal consistency of activity model
pl: Spójność wewnętrzna modelu aktywności

source: Consistency of activity model and use case model
pl: Spójność modelu aktywności i modelu przypadków użycia

source: Consistency of activity model and requirements specifications
pl: Spójność modelu aktywności i specyfikacji wymagań

source: Consistency of activity model and class model
pl: Spójność modelu aktywności i modelu klas

source: Consistency of activity model and behavioral model
pl: Spójność modelu aktywności i modelu behawioralnego

source: State model completeness
pl: Kompletność modelu stanów

source: Completeness of condition machines
pl: Kompletność maszyn stanów

source: Complete identification of state machines
pl: Kompletność identyfikacji maszyn stanów

source: Completeness of state identification
pl: Kompletność identyfikacji stanów

source: Completeness of event identification
pl: Kompletność identyfikacji zdarzeń

source: Completeness of transition definitions
pl: Kompletność definicji przejść

source: Completeness of machine specifications
pl: Kompletność specyfikacji maszyn stanów

source: Completeness of state specifications
pl: Kompletność specyfikacji stanów

source: Completeness of event specifications
pl: Kompletność specyfikacji zdarzeń

source: Completeness of pass specifications
pl: Kompletność specyfikacji przejść

source: State model internal consistency
pl: Spójność wewnętrzna modelu stanów

source: Consistency of state model and requirements specifications
pl: Spójność modelu stanów i specyfikacji wymagań

source: State model and class model consistency
pl: Spójność modelu stanów i modelu klas

source: Ease of verification
pl: Łatwość weryfikacji

source: Component model completeness
pl: Kompletność modelu komponentów

source: Completeness of component definitions
pl: Kompletność definicji komponentów

source: Completeness of component identification
pl: Kompletność identyfikacji komponentów

source: Completeness of assignment of classes to components
pl: Kompletność przypisania klas do komponentów

source: Completeness of component specifications
pl: Kompletność specyfikacji komponentów

source: Internal consistency of component model
pl: Spójność wewnętrzna modelu komponentów

source: Consistency of component model and requirements specifications
pl: Spójność modelu komponentów i specyfikacji wymagań

source: Consistency of class model and static model
pl: Spójność modelu klas i modelu statycznego

source: Consistency of class model and functional model
pl: Spójność modelu klas i modelu funkcjonalnego

source: Modularity
pl: Modularność

source: Completeness of user interface design
pl: Kompletność projektu interfejsu użytkownika

source: Completeness of user interface definitions
pl: Kompletność definicji interfejsów użytkownika

source: Completeness of form definitions
pl: Kompletność definicji formularzy

source: Completeness of dialogue definitions
pl: Kompletność definicji dialogów

source: Completeness of report definitions
pl: Kompletność definicji raportów

source: Completeness of control definitions
pl: Kompletność definicji sterowania

source: Completeness of navigation diagrams
pl: Kompletność diagramów nawigacji

source: Completeness of form designs
pl: Kompletność projektów formularzy

source: Completeness of report designs
pl: Kompletność projektów raportów

source: Completeness of control specifications
pl: Kompletność specyfikacji sterowania

source: Completeness of form specifications
pl: Kompletność specyfikacji formularzy

source: Completeness of report specifications
pl: Kompletność specyfikacji raportów

source: Internal consistency of ui design
pl: Spójność wewnętrzna projektu interfejsu użytkownika

source: Consistency of ui design and requirements specifications
pl: Spójność projektu interfejsu użytkownika i specyfikacji wymagań

source: Data model completeness
pl: Kompletność modelu danych

source: Completeness of data structure definitions
pl: Kompletność definicji struktur danych

source: Completeness of data structure identification
pl: Kompletność identyfikacji struktur danych

source: Completeness of diagrams
pl: Kompletność diagramów

source: Completeness of structure specifications
pl: Kompletność specyfikacji struktur

source: Data model internal consistency
pl: Spójność wewnętrzna modelu danych

source: Data model and requirements specification consistency
pl: Spójność modelu danych i specyfikacji wymagań

source: Data model and static model consistency
pl: Spójność modelu danych i modelu statycznego

source: Completeness of goal achievement
pl: Kompletność realizacji celów

source: Completeness meets shareholder requirements
pl: Kompletność spełnia wymagań udziałowców

source: Completeness meets user requirements
pl: Kompletność spełnia wymagań użytkowników

source: Completeness of function implementation
pl: Kompletność implementacji funkcji

source: Data implementation completeness
pl: Kompletność implementacji danych

source: Completeness of processing implementation
pl: Kompletność implementacji przetwarzania

source: Completeness of system implementation
pl: Kompletność implementacji systemu

source: Completeness of interface implementations
pl: Kompletność implementacji interfejsów

source: Functional reliability
pl: Niezawodność funkcjonalna

source: Functional correctness
pl: Poprawność funkcjonalna

source: Correctness of documentation
pl: Poprawność dokumentacji

source: Functional consistency
pl: Spójność funkcjonalna

source: Resolving contradiction
pl: Rozwiązanie sprzeczności

source: Functional intelligibility
pl: Zrozumiałość funkcjonalna

source: Documentation comprehensibility
pl: Zrozumiałość dokumentacji

source: Completeness of documentation
pl: Kompletność dokumentacji

source: Source code modifiability
pl: Modyfikowalność kodu źródłowego

source: Internal connections
pl: Powiązania wewnętrzne
